TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.5.LTS *
       3                    ;* Date/Time created: Mon Nov 29 14:32:17 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pschaumont\workspace_ccs\workspace_ece4703b21\perfo
      13                            .global taps
      14                            .common taps,32,4
      15                    $C$DW$1 .dwtag  DW_TAG_variable

    3011                            .dwattr $C$DW$133, DW_AT_name("ARM_MATH_TEST_FAILURE")
    3012                            .dwattr $C$DW$133, DW_AT_const_value(-6)
    3013                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   56

    3014                            .dwattr $C$DW$133, DW_AT_decl_line(0x18b)
    3015                            .dwattr $C$DW$133, DW_AT_decl_column(0x05)
    3016                    
    3017                            .dwattr $C$DW$T$323, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    3018                            .dwattr $C$DW$T$323, DW_AT_decl_line(0x184)
    3019                            .dwattr $C$DW$T$323, DW_AT_decl_column(0x03)
    3020                            .dwendtag $C$DW$T$323
    3021                    
    3022                    $C$DW$T$324     .dwtag  DW_TAG_typedef
    3023                            .dwattr $C$DW$T$324, DW_AT_name("arm_status")
    3024                            .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
    3025                            .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
    3026                            .dwattr $C$DW$T$324, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    3027                            .dwattr $C$DW$T$324, DW_AT_decl_line(0x18c)
    3028                            .dwattr $C$DW$T$324, DW_AT_decl_column(0x05)
    3029                    
    3030                    
    3031                    $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
    3032                            .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
    3033                    $C$DW$134       .dwtag  DW_TAG_enumerator
    3034                            .dwattr $C$DW$134, DW_AT_name("BUFLEN_8")
    3035                            .dwattr $C$DW$134, DW_AT_const_value(0x00)
    3036                            .dwattr $C$DW$134, DW_AT_decl_file("..\xlaudio.h")
    3037                            .dwattr $C$DW$134, DW_AT_decl_line(0x2d)
    3038                            .dwattr $C$DW$134, DW_AT_decl_column(0x05)
    3039                    
    3040                    $C$DW$135       .dwtag  DW_TAG_enumerator
    3041                            .dwattr $C$DW$135, DW_AT_name("BUFLEN_16")
    3042                            .dwattr $C$DW$135, DW_AT_const_value(0x01)
    3043                            .dwattr $C$DW$135, DW_AT_decl_file("..\xlaudio.h")
    3044                            .dwattr $C$DW$135, DW_AT_decl_line(0x2e)
    3045                            .dwattr $C$DW$135, DW_AT_decl_column(0x05)
    3046                    
    3047                    $C$DW$136       .dwtag  DW_TAG_enumerator
    3048                            .dwattr $C$DW$136, DW_AT_name("BUFLEN_32")
    3049                            .dwattr $C$DW$136, DW_AT_const_value(0x02)
    3050                            .dwattr $C$DW$136, DW_AT_decl_file("..\xlaudio.h")
    3051                            .dwattr $C$DW$136, DW_AT_decl_line(0x2f)
    3052                            .dwattr $C$DW$136, DW_AT_decl_column(0x05)
    3053                    
    3054                    $C$DW$137       .dwtag  DW_TAG_enumerator
    3055                            .dwattr $C$DW$137, DW_AT_name("BUFLEN_64")
    3056                            .dwattr $C$DW$137, DW_AT_const_value(0x03)
    3057                            .dwattr $C$DW$137, DW_AT_decl_file("..\xlaudio.h")
    3058                            .dwattr $C$DW$137, DW_AT_decl_line(0x30)
    3059                            .dwattr $C$DW$137, DW_AT_decl_column(0x05)
    3060                    
    3061                    $C$DW$138       .dwtag  DW_TAG_enumerator
    3062                            .dwattr $C$DW$138, DW_AT_name("BUFLEN_128")
    3063                            .dwattr $C$DW$138, DW_AT_const_value(0x04)
    3064                            .dwattr $C$DW$138, DW_AT_decl_file("..\xlaudio.h")
    3065                            .dwattr $C$DW$138, DW_AT_decl_line(0x31)
    3066                            .dwattr $C$DW$138, DW_AT_decl_column(0x05)
    3067                    
    3068                            .dwattr $C$DW$T$325, DW_AT_decl_file("..\xlaudio.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   57

    3069                            .dwattr $C$DW$T$325, DW_AT_decl_line(0x2c)
    3070                            .dwattr $C$DW$T$325, DW_AT_decl_column(0x0e)
    3071                            .dwendtag $C$DW$T$325
    3072                    
    3073                    $C$DW$T$326     .dwtag  DW_TAG_typedef
    3074                            .dwattr $C$DW$T$326, DW_AT_name("buflen_enum_t")
    3075                            .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
    3076                            .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    3077                            .dwattr $C$DW$T$326, DW_AT_decl_file("..\xlaudio.h")
    3078                            .dwattr $C$DW$T$326, DW_AT_decl_line(0x32)
    3079                            .dwattr $C$DW$T$326, DW_AT_decl_column(0x03)
    3080                    
    3081                    
    3082                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3083                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    3084                    $C$DW$139       .dwtag  DW_TAG_member
    3085                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$10)
    3086                            .dwattr $C$DW$139, DW_AT_name("quot")
    3087                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("quot")
    3088                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3089                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    3090                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3091                            .dwattr $C$DW$139, DW_AT_decl_line(0x4e)
    3092                            .dwattr $C$DW$139, DW_AT_decl_column(0x16)
    3093                    
    3094                    $C$DW$140       .dwtag  DW_TAG_member
    3095                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$10)
    3096                            .dwattr $C$DW$140, DW_AT_name("rem")
    3097                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rem")
    3098                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3099                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    3100                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3101                            .dwattr $C$DW$140, DW_AT_decl_line(0x4e)
    3102                            .dwattr $C$DW$140, DW_AT_decl_column(0x1c)
    3103                    
    3104                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    3105                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x4e)
    3106                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3107                            .dwendtag $C$DW$T$22
    3108                    
    3109                    $C$DW$T$327     .dwtag  DW_TAG_typedef
    3110                            .dwattr $C$DW$T$327, DW_AT_name("div_t")
    3111                            .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$22)
    3112                            .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    3113                            .dwattr $C$DW$T$327, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    3114                            .dwattr $C$DW$T$327, DW_AT_decl_line(0x4e)
    3115                            .dwattr $C$DW$T$327, DW_AT_decl_column(0x23)
    3116                    
    3117                    
    3118                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3119                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    3120                    $C$DW$141       .dwtag  DW_TAG_member
    3121                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$10)
    3122                            .dwattr $C$DW$141, DW_AT_name("quot")
    3123                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   58

    3124                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    3126                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3127                            .dwattr $C$DW$141, DW_AT_decl_line(0x53)
    3128                            .dwattr $C$DW$141, DW_AT_decl_column(0x16)
    3129                    
    3130                    $C$DW$142       .dwtag  DW_TAG_member
    3131                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$10)
    3132                            .dwattr $C$DW$142, DW_AT_name("rem")
    3133                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("rem")
    3134                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3135                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    3136                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3137                            .dwattr $C$DW$142, DW_AT_decl_line(0x53)
    3138                            .dwattr $C$DW$142, DW_AT_decl_column(0x1c)
    3139                    
    3140                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    3141                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x53)
    3142                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    3143                            .dwendtag $C$DW$T$23
    3144                    
    3145                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    3146                            .dwattr $C$DW$T$328, DW_AT_name("ldiv_t")
    3147                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$23)
    3148                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    3149                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    3150                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x53)
    3151                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x23)
    3152                    
    3153                    
    3154                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3155                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    3156                    $C$DW$143       .dwtag  DW_TAG_member
    3157                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$14)
    3158                            .dwattr $C$DW$143, DW_AT_name("quot")
    3159                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("quot")
    3160                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    3162                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3163                            .dwattr $C$DW$143, DW_AT_decl_line(0x5b)
    3164                            .dwattr $C$DW$143, DW_AT_decl_column(0x1c)
    3165                    
    3166                    $C$DW$144       .dwtag  DW_TAG_member
    3167                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$14)
    3168                            .dwattr $C$DW$144, DW_AT_name("rem")
    3169                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("rem")
    3170                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3171                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    3172                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3173                            .dwattr $C$DW$144, DW_AT_decl_line(0x5b)
    3174                            .dwattr $C$DW$144, DW_AT_decl_column(0x22)
    3175                    
    3176                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    3177                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x5b)
    3178                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   59

    3179                            .dwendtag $C$DW$T$24
    3180                    
    3181                    $C$DW$T$329     .dwtag  DW_TAG_typedef
    3182                            .dwattr $C$DW$T$329, DW_AT_name("lldiv_t")
    3183                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$24)
    3184                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    3185                            .dwattr $C$DW$T$329, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    3186                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x5b)
    3187                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x29)
    3188                    
    3189                    
    3190                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3191                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    3192                    $C$DW$145       .dwtag  DW_TAG_member
    3193                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$14)
    3194                            .dwattr $C$DW$145, DW_AT_name("__max_align1")
    3195                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("__max_align1")
    3196                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3197                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    3198                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3199                            .dwattr $C$DW$145, DW_AT_decl_line(0x7b)
    3200                            .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    3201                    
    3202                    $C$DW$146       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$18)
    3204                            .dwattr $C$DW$146, DW_AT_name("__max_align2")
    3205                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("__max_align2")
    3206                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3207                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    3209                            .dwattr $C$DW$146, DW_AT_decl_line(0x7c)
    3210                            .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    3211                    
    3212                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    3213                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x7a)
    3214                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3215                            .dwendtag $C$DW$T$25
    3216                    
    3217                    $C$DW$T$330     .dwtag  DW_TAG_typedef
    3218                            .dwattr $C$DW$T$330, DW_AT_name("__max_align_t")
    3219                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$25)
    3220                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
    3221                            .dwattr $C$DW$T$330, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    3222                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x7d)
    3223                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
    3224                    
    3225                    
    3226                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3227                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    3228                    $C$DW$147       .dwtag  DW_TAG_member
    3229                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    3230                            .dwattr $C$DW$147, DW_AT_name("_reserved0")
    3231                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("_reserved0")
    3232                            .dwattr $C$DW$147, DW_AT_bit_offset(0x10)
    3233                            .dwattr $C$DW$147, DW_AT_bit_size(0x10)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   60

    3234                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    3236                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3237                            .dwattr $C$DW$147, DW_AT_decl_line(0x105)
    3238                            .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    3239                    
    3240                    $C$DW$148       .dwtag  DW_TAG_member
    3241                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    3242                            .dwattr $C$DW$148, DW_AT_name("GE")
    3243                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("GE")
    3244                            .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    3245                            .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    3246                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3247                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    3248                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3249                            .dwattr $C$DW$148, DW_AT_decl_line(0x106)
    3250                            .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    3251                    
    3252                    $C$DW$149       .dwtag  DW_TAG_member
    3253                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    3254                            .dwattr $C$DW$149, DW_AT_name("_reserved1")
    3255                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("_reserved1")
    3256                            .dwattr $C$DW$149, DW_AT_bit_offset(0x05)
    3257                            .dwattr $C$DW$149, DW_AT_bit_size(0x07)
    3258                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    3260                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3261                            .dwattr $C$DW$149, DW_AT_decl_line(0x107)
    3262                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    3263                    
    3264                    $C$DW$150       .dwtag  DW_TAG_member
    3265                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    3266                            .dwattr $C$DW$150, DW_AT_name("Q")
    3267                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("Q")
    3268                            .dwattr $C$DW$150, DW_AT_bit_offset(0x04)
    3269                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    3270                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3271                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    3272                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3273                            .dwattr $C$DW$150, DW_AT_decl_line(0x108)
    3274                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    3275                    
    3276                    $C$DW$151       .dwtag  DW_TAG_member
    3277                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    3278                            .dwattr $C$DW$151, DW_AT_name("V")
    3279                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("V")
    3280                            .dwattr $C$DW$151, DW_AT_bit_offset(0x03)
    3281                            .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    3282                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3283                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    3284                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3285                            .dwattr $C$DW$151, DW_AT_decl_line(0x109)
    3286                            .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    3287                    
    3288                    $C$DW$152       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   61

    3289                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    3290                            .dwattr $C$DW$152, DW_AT_name("C")
    3291                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("C")
    3292                            .dwattr $C$DW$152, DW_AT_bit_offset(0x02)
    3293                            .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    3294                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    3296                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3297                            .dwattr $C$DW$152, DW_AT_decl_line(0x10a)
    3298                            .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    3299                    
    3300                    $C$DW$153       .dwtag  DW_TAG_member
    3301                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    3302                            .dwattr $C$DW$153, DW_AT_name("Z")
    3303                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("Z")
    3304                            .dwattr $C$DW$153, DW_AT_bit_offset(0x01)
    3305                            .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    3306                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3307                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    3308                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3309                            .dwattr $C$DW$153, DW_AT_decl_line(0x10b)
    3310                            .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    3311                    
    3312                    $C$DW$154       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    3314                            .dwattr $C$DW$154, DW_AT_name("N")
    3315                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("N")
    3316                            .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    3317                            .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    3318                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    3320                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3321                            .dwattr $C$DW$154, DW_AT_decl_line(0x10c)
    3322                            .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    3323                    
    3324                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3325                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x104)
    3326                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    3327                            .dwendtag $C$DW$T$28
    3328                    
    3329                    
    3330                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3331                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    3332                    $C$DW$155       .dwtag  DW_TAG_member
    3333                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    3334                            .dwattr $C$DW$155, DW_AT_name("ISR")
    3335                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("ISR")
    3336                            .dwattr $C$DW$155, DW_AT_bit_offset(0x17)
    3337                            .dwattr $C$DW$155, DW_AT_bit_size(0x09)
    3338                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    3340                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3341                            .dwattr $C$DW$155, DW_AT_decl_line(0x12c)
    3342                            .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    3343                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   62

    3344                    $C$DW$156       .dwtag  DW_TAG_member
    3345                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    3346                            .dwattr $C$DW$156, DW_AT_name("_reserved0")
    3347                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("_reserved0")
    3348                            .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    3349                            .dwattr $C$DW$156, DW_AT_bit_size(0x17)
    3350                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3351                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    3352                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3353                            .dwattr $C$DW$156, DW_AT_decl_line(0x12d)
    3354                            .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    3355                    
    3356                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3357                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x12b)
    3358                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    3359                            .dwendtag $C$DW$T$29
    3360                    
    3361                    
    3362                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3363                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    3364                    $C$DW$157       .dwtag  DW_TAG_member
    3365                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    3366                            .dwattr $C$DW$157, DW_AT_name("ISR")
    3367                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("ISR")
    3368                            .dwattr $C$DW$157, DW_AT_bit_offset(0x17)
    3369                            .dwattr $C$DW$157, DW_AT_bit_size(0x09)
    3370                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    3372                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3373                            .dwattr $C$DW$157, DW_AT_decl_line(0x13e)
    3374                            .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    3375                    
    3376                    $C$DW$158       .dwtag  DW_TAG_member
    3377                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    3378                            .dwattr $C$DW$158, DW_AT_name("_reserved0")
    3379                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("_reserved0")
    3380                            .dwattr $C$DW$158, DW_AT_bit_offset(0x16)
    3381                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    3382                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3383                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3384                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3385                            .dwattr $C$DW$158, DW_AT_decl_line(0x13f)
    3386                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    3387                    
    3388                    $C$DW$159       .dwtag  DW_TAG_member
    3389                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    3390                            .dwattr $C$DW$159, DW_AT_name("ICI_IT_1")
    3391                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("ICI_IT_1")
    3392                            .dwattr $C$DW$159, DW_AT_bit_offset(0x10)
    3393                            .dwattr $C$DW$159, DW_AT_bit_size(0x06)
    3394                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3395                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3396                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3397                            .dwattr $C$DW$159, DW_AT_decl_line(0x140)
    3398                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   63

    3399                    
    3400                    $C$DW$160       .dwtag  DW_TAG_member
    3401                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    3402                            .dwattr $C$DW$160, DW_AT_name("GE")
    3403                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("GE")
    3404                            .dwattr $C$DW$160, DW_AT_bit_offset(0x0c)
    3405                            .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    3406                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3407                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3408                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3409                            .dwattr $C$DW$160, DW_AT_decl_line(0x141)
    3410                            .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    3411                    
    3412                    $C$DW$161       .dwtag  DW_TAG_member
    3413                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    3414                            .dwattr $C$DW$161, DW_AT_name("_reserved1")
    3415                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("_reserved1")
    3416                            .dwattr $C$DW$161, DW_AT_bit_offset(0x08)
    3417                            .dwattr $C$DW$161, DW_AT_bit_size(0x04)
    3418                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3420                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3421                            .dwattr $C$DW$161, DW_AT_decl_line(0x142)
    3422                            .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    3423                    
    3424                    $C$DW$162       .dwtag  DW_TAG_member
    3425                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    3426                            .dwattr $C$DW$162, DW_AT_name("T")
    3427                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("T")
    3428                            .dwattr $C$DW$162, DW_AT_bit_offset(0x07)
    3429                            .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    3430                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3431                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3432                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3433                            .dwattr $C$DW$162, DW_AT_decl_line(0x143)
    3434                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    3435                    
    3436                    $C$DW$163       .dwtag  DW_TAG_member
    3437                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    3438                            .dwattr $C$DW$163, DW_AT_name("ICI_IT_2")
    3439                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ICI_IT_2")
    3440                            .dwattr $C$DW$163, DW_AT_bit_offset(0x05)
    3441                            .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    3442                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3443                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3444                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3445                            .dwattr $C$DW$163, DW_AT_decl_line(0x144)
    3446                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    3447                    
    3448                    $C$DW$164       .dwtag  DW_TAG_member
    3449                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3450                            .dwattr $C$DW$164, DW_AT_name("Q")
    3451                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("Q")
    3452                            .dwattr $C$DW$164, DW_AT_bit_offset(0x04)
    3453                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   64

    3454                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3456                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3457                            .dwattr $C$DW$164, DW_AT_decl_line(0x145)
    3458                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    3459                    
    3460                    $C$DW$165       .dwtag  DW_TAG_member
    3461                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$27)
    3462                            .dwattr $C$DW$165, DW_AT_name("V")
    3463                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("V")
    3464                            .dwattr $C$DW$165, DW_AT_bit_offset(0x03)
    3465                            .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    3466                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3467                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3468                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3469                            .dwattr $C$DW$165, DW_AT_decl_line(0x146)
    3470                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    3471                    
    3472                    $C$DW$166       .dwtag  DW_TAG_member
    3473                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    3474                            .dwattr $C$DW$166, DW_AT_name("C")
    3475                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("C")
    3476                            .dwattr $C$DW$166, DW_AT_bit_offset(0x02)
    3477                            .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3478                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3480                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3481                            .dwattr $C$DW$166, DW_AT_decl_line(0x147)
    3482                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    3483                    
    3484                    $C$DW$167       .dwtag  DW_TAG_member
    3485                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$27)
    3486                            .dwattr $C$DW$167, DW_AT_name("Z")
    3487                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("Z")
    3488                            .dwattr $C$DW$167, DW_AT_bit_offset(0x01)
    3489                            .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3490                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3492                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3493                            .dwattr $C$DW$167, DW_AT_decl_line(0x148)
    3494                            .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    3495                    
    3496                    $C$DW$168       .dwtag  DW_TAG_member
    3497                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    3498                            .dwattr $C$DW$168, DW_AT_name("N")
    3499                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("N")
    3500                            .dwattr $C$DW$168, DW_AT_bit_offset(0x00)
    3501                            .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3502                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3503                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3504                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3505                            .dwattr $C$DW$168, DW_AT_decl_line(0x149)
    3506                            .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    3507                    
    3508                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   65

    3509                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x13d)
    3510                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    3511                            .dwendtag $C$DW$T$30
    3512                    
    3513                    
    3514                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3515                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    3516                    $C$DW$169       .dwtag  DW_TAG_member
    3517                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$27)
    3518                            .dwattr $C$DW$169, DW_AT_name("nPRIV")
    3519                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("nPRIV")
    3520                            .dwattr $C$DW$169, DW_AT_bit_offset(0x1f)
    3521                            .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3522                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3523                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3524                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3525                            .dwattr $C$DW$169, DW_AT_decl_line(0x175)
    3526                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    3527                    
    3528                    $C$DW$170       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$27)
    3530                            .dwattr $C$DW$170, DW_AT_name("SPSEL")
    3531                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("SPSEL")
    3532                            .dwattr $C$DW$170, DW_AT_bit_offset(0x1e)
    3533                            .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3534                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3535                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3536                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3537                            .dwattr $C$DW$170, DW_AT_decl_line(0x176)
    3538                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    3539                    
    3540                    $C$DW$171       .dwtag  DW_TAG_member
    3541                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    3542                            .dwattr $C$DW$171, DW_AT_name("FPCA")
    3543                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("FPCA")
    3544                            .dwattr $C$DW$171, DW_AT_bit_offset(0x1d)
    3545                            .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    3546                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3547                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3548                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3549                            .dwattr $C$DW$171, DW_AT_decl_line(0x177)
    3550                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    3551                    
    3552                    $C$DW$172       .dwtag  DW_TAG_member
    3553                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    3554                            .dwattr $C$DW$172, DW_AT_name("_reserved0")
    3555                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("_reserved0")
    3556                            .dwattr $C$DW$172, DW_AT_bit_offset(0x00)
    3557                            .dwattr $C$DW$172, DW_AT_bit_size(0x1d)
    3558                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3559                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3560                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3561                            .dwattr $C$DW$172, DW_AT_decl_line(0x178)
    3562                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    3563                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   66

    3564                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3565                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x174)
    3566                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    3567                            .dwendtag $C$DW$T$31
    3568                    
    3569                    
    3570                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3571                            .dwattr $C$DW$T$41, DW_AT_byte_size(0xe04)
    3572                    $C$DW$173       .dwtag  DW_TAG_member
    3573                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$33)
    3574                            .dwattr $C$DW$173, DW_AT_name("ISER")
    3575                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ISER")
    3576                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3577                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3578                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3579                            .dwattr $C$DW$173, DW_AT_decl_line(0x196)
    3580                            .dwattr $C$DW$173, DW_AT_decl_column(0x12)
    3581                    
    3582                    $C$DW$174       .dwtag  DW_TAG_member
    3583                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$34)
    3584                            .dwattr $C$DW$174, DW_AT_name("RESERVED0")
    3585                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("RESERVED0")
    3586                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3587                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3588                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3589                            .dwattr $C$DW$174, DW_AT_decl_line(0x197)
    3590                            .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    3591                    
    3592                    $C$DW$175       .dwtag  DW_TAG_member
    3593                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$33)
    3594                            .dwattr $C$DW$175, DW_AT_name("ICER")
    3595                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ICER")
    3596                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3597                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3598                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3599                            .dwattr $C$DW$175, DW_AT_decl_line(0x198)
    3600                            .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    3601                    
    3602                    $C$DW$176       .dwtag  DW_TAG_member
    3603                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$34)
    3604                            .dwattr $C$DW$176, DW_AT_name("RSERVED1")
    3605                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("RSERVED1")
    3606                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3607                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3608                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3609                            .dwattr $C$DW$176, DW_AT_decl_line(0x199)
    3610                            .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    3611                    
    3612                    $C$DW$177       .dwtag  DW_TAG_member
    3613                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$33)
    3614                            .dwattr $C$DW$177, DW_AT_name("ISPR")
    3615                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ISPR")
    3616                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3617                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3618                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   67

    3619                            .dwattr $C$DW$177, DW_AT_decl_line(0x19a)
    3620                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    3621                    
    3622                    $C$DW$178       .dwtag  DW_TAG_member
    3623                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    3624                            .dwattr $C$DW$178, DW_AT_name("RESERVED2")
    3625                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("RESERVED2")
    3626                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3627                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3628                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3629                            .dwattr $C$DW$178, DW_AT_decl_line(0x19b)
    3630                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    3631                    
    3632                    $C$DW$179       .dwtag  DW_TAG_member
    3633                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$33)
    3634                            .dwattr $C$DW$179, DW_AT_name("ICPR")
    3635                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ICPR")
    3636                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3637                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3638                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3639                            .dwattr $C$DW$179, DW_AT_decl_line(0x19c)
    3640                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    3641                    
    3642                    $C$DW$180       .dwtag  DW_TAG_member
    3643                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$34)
    3644                            .dwattr $C$DW$180, DW_AT_name("RESERVED3")
    3645                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("RESERVED3")
    3646                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3647                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3648                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3649                            .dwattr $C$DW$180, DW_AT_decl_line(0x19d)
    3650                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    3651                    
    3652                    $C$DW$181       .dwtag  DW_TAG_member
    3653                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$33)
    3654                            .dwattr $C$DW$181, DW_AT_name("IABR")
    3655                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("IABR")
    3656                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3657                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3658                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3659                            .dwattr $C$DW$181, DW_AT_decl_line(0x19e)
    3660                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    3661                    
    3662                    $C$DW$182       .dwtag  DW_TAG_member
    3663                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$35)
    3664                            .dwattr $C$DW$182, DW_AT_name("RESERVED4")
    3665                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("RESERVED4")
    3666                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3667                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3668                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3669                            .dwattr $C$DW$182, DW_AT_decl_line(0x19f)
    3670                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    3671                    
    3672                    $C$DW$183       .dwtag  DW_TAG_member
    3673                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$39)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   68

    3674                            .dwattr $C$DW$183, DW_AT_name("IP")
    3675                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("IP")
    3676                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    3677                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3678                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3679                            .dwattr $C$DW$183, DW_AT_decl_line(0x1a0)
    3680                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    3681                    
    3682                    $C$DW$184       .dwtag  DW_TAG_member
    3683                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    3684                            .dwattr $C$DW$184, DW_AT_name("RESERVED5")
    3685                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("RESERVED5")
    3686                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    3687                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3688                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3689                            .dwattr $C$DW$184, DW_AT_decl_line(0x1a1)
    3690                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    3691                    
    3692                    $C$DW$185       .dwtag  DW_TAG_member
    3693                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    3694                            .dwattr $C$DW$185, DW_AT_name("STIR")
    3695                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("STIR")
    3696                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3697                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3698                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3699                            .dwattr $C$DW$185, DW_AT_decl_line(0x1a2)
    3700                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    3701                    
    3702                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3703                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x195)
    3704                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    3705                            .dwendtag $C$DW$T$41
    3706                    
    3707                    $C$DW$T$331     .dwtag  DW_TAG_typedef
    3708                            .dwattr $C$DW$T$331, DW_AT_name("NVIC_Type")
    3709                            .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$41)
    3710                            .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
    3711                            .dwattr $C$DW$T$331, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3712                            .dwattr $C$DW$T$331, DW_AT_decl_line(0x1a3)
    3713                            .dwattr $C$DW$T$331, DW_AT_decl_column(0x04)
    3714                    
    3715                    
    3716                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3717                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x8c)
    3718                    $C$DW$186       .dwtag  DW_TAG_member
    3719                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$42)
    3720                            .dwattr $C$DW$186, DW_AT_name("CPUID")
    3721                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("CPUID")
    3722                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3723                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3724                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3725                            .dwattr $C$DW$186, DW_AT_decl_line(0x1b8)
    3726                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    3727                    
    3728                    $C$DW$187       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   69

    3729                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    3730                            .dwattr $C$DW$187, DW_AT_name("ICSR")
    3731                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("ICSR")
    3732                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3733                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3734                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3735                            .dwattr $C$DW$187, DW_AT_decl_line(0x1b9)
    3736                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    3737                    
    3738                    $C$DW$188       .dwtag  DW_TAG_member
    3739                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    3740                            .dwattr $C$DW$188, DW_AT_name("VTOR")
    3741                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("VTOR")
    3742                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3743                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3744                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3745                            .dwattr $C$DW$188, DW_AT_decl_line(0x1ba)
    3746                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    3747                    
    3748                    $C$DW$189       .dwtag  DW_TAG_member
    3749                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    3750                            .dwattr $C$DW$189, DW_AT_name("AIRCR")
    3751                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("AIRCR")
    3752                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3753                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3754                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3755                            .dwattr $C$DW$189, DW_AT_decl_line(0x1bb)
    3756                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    3757                    
    3758                    $C$DW$190       .dwtag  DW_TAG_member
    3759                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
    3760                            .dwattr $C$DW$190, DW_AT_name("SCR")
    3761                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("SCR")
    3762                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3763                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3764                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3765                            .dwattr $C$DW$190, DW_AT_decl_line(0x1bc)
    3766                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    3767                    
    3768                    $C$DW$191       .dwtag  DW_TAG_member
    3769                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$32)
    3770                            .dwattr $C$DW$191, DW_AT_name("CCR")
    3771                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("CCR")
    3772                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3773                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3774                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3775                            .dwattr $C$DW$191, DW_AT_decl_line(0x1bd)
    3776                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3777                    
    3778                    $C$DW$192       .dwtag  DW_TAG_member
    3779                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$43)
    3780                            .dwattr $C$DW$192, DW_AT_name("SHP")
    3781                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("SHP")
    3782                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3783                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   70

    3784                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3785                            .dwattr $C$DW$192, DW_AT_decl_line(0x1be)
    3786                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3787                    
    3788                    $C$DW$193       .dwtag  DW_TAG_member
    3789                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$32)
    3790                            .dwattr $C$DW$193, DW_AT_name("SHCSR")
    3791                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("SHCSR")
    3792                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3793                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3794                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3795                            .dwattr $C$DW$193, DW_AT_decl_line(0x1bf)
    3796                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3797                    
    3798                    $C$DW$194       .dwtag  DW_TAG_member
    3799                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$32)
    3800                            .dwattr $C$DW$194, DW_AT_name("CFSR")
    3801                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("CFSR")
    3802                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3803                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3804                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3805                            .dwattr $C$DW$194, DW_AT_decl_line(0x1c0)
    3806                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3807                    
    3808                    $C$DW$195       .dwtag  DW_TAG_member
    3809                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$32)
    3810                            .dwattr $C$DW$195, DW_AT_name("HFSR")
    3811                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("HFSR")
    3812                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3813                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3814                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3815                            .dwattr $C$DW$195, DW_AT_decl_line(0x1c1)
    3816                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3817                    
    3818                    $C$DW$196       .dwtag  DW_TAG_member
    3819                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$32)
    3820                            .dwattr $C$DW$196, DW_AT_name("DFSR")
    3821                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("DFSR")
    3822                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3823                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3824                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3825                            .dwattr $C$DW$196, DW_AT_decl_line(0x1c2)
    3826                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    3827                    
    3828                    $C$DW$197       .dwtag  DW_TAG_member
    3829                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    3830                            .dwattr $C$DW$197, DW_AT_name("MMFAR")
    3831                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("MMFAR")
    3832                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3833                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3834                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3835                            .dwattr $C$DW$197, DW_AT_decl_line(0x1c3)
    3836                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3837                    
    3838                    $C$DW$198       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   71

    3839                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$32)
    3840                            .dwattr $C$DW$198, DW_AT_name("BFAR")
    3841                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("BFAR")
    3842                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3843                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3844                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3845                            .dwattr $C$DW$198, DW_AT_decl_line(0x1c4)
    3846                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3847                    
    3848                    $C$DW$199       .dwtag  DW_TAG_member
    3849                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$32)
    3850                            .dwattr $C$DW$199, DW_AT_name("AFSR")
    3851                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("AFSR")
    3852                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3853                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3854                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3855                            .dwattr $C$DW$199, DW_AT_decl_line(0x1c5)
    3856                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3857                    
    3858                    $C$DW$200       .dwtag  DW_TAG_member
    3859                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$44)
    3860                            .dwattr $C$DW$200, DW_AT_name("PFR")
    3861                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("PFR")
    3862                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3863                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3864                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3865                            .dwattr $C$DW$200, DW_AT_decl_line(0x1c6)
    3866                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3867                    
    3868                    $C$DW$201       .dwtag  DW_TAG_member
    3869                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$42)
    3870                            .dwattr $C$DW$201, DW_AT_name("DFR")
    3871                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("DFR")
    3872                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3873                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3874                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3875                            .dwattr $C$DW$201, DW_AT_decl_line(0x1c7)
    3876                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3877                    
    3878                    $C$DW$202       .dwtag  DW_TAG_member
    3879                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$42)
    3880                            .dwattr $C$DW$202, DW_AT_name("ADR")
    3881                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ADR")
    3882                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3883                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3884                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3885                            .dwattr $C$DW$202, DW_AT_decl_line(0x1c8)
    3886                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3887                    
    3888                    $C$DW$203       .dwtag  DW_TAG_member
    3889                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$45)
    3890                            .dwattr $C$DW$203, DW_AT_name("MMFR")
    3891                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("MMFR")
    3892                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3893                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   72

    3894                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3895                            .dwattr $C$DW$203, DW_AT_decl_line(0x1c9)
    3896                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3897                    
    3898                    $C$DW$204       .dwtag  DW_TAG_member
    3899                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$46)
    3900                            .dwattr $C$DW$204, DW_AT_name("ISAR")
    3901                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ISAR")
    3902                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3903                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3904                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3905                            .dwattr $C$DW$204, DW_AT_decl_line(0x1ca)
    3906                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3907                    
    3908                    $C$DW$205       .dwtag  DW_TAG_member
    3909                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$47)
    3910                            .dwattr $C$DW$205, DW_AT_name("RESERVED0")
    3911                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("RESERVED0")
    3912                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3913                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3914                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3915                            .dwattr $C$DW$205, DW_AT_decl_line(0x1cb)
    3916                            .dwattr $C$DW$205, DW_AT_decl_column(0x12)
    3917                    
    3918                    $C$DW$206       .dwtag  DW_TAG_member
    3919                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    3920                            .dwattr $C$DW$206, DW_AT_name("CPACR")
    3921                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("CPACR")
    3922                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3923                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3924                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3925                            .dwattr $C$DW$206, DW_AT_decl_line(0x1cc)
    3926                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3927                    
    3928                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3929                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x1b7)
    3930                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    3931                            .dwendtag $C$DW$T$48
    3932                    
    3933                    $C$DW$T$332     .dwtag  DW_TAG_typedef
    3934                            .dwattr $C$DW$T$332, DW_AT_name("SCB_Type")
    3935                            .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$48)
    3936                            .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
    3937                            .dwattr $C$DW$T$332, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3938                            .dwattr $C$DW$T$332, DW_AT_decl_line(0x1cd)
    3939                            .dwattr $C$DW$T$332, DW_AT_decl_column(0x03)
    3940                    
    3941                    
    3942                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3943                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    3944                    $C$DW$207       .dwtag  DW_TAG_member
    3945                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$49)
    3946                            .dwattr $C$DW$207, DW_AT_name("RESERVED0")
    3947                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("RESERVED0")
    3948                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   73

    3949                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3950                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3951                            .dwattr $C$DW$207, DW_AT_decl_line(0x2cf)
    3952                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3953                    
    3954                    $C$DW$208       .dwtag  DW_TAG_member
    3955                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$42)
    3956                            .dwattr $C$DW$208, DW_AT_name("ICTR")
    3957                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ICTR")
    3958                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3959                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3960                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3961                            .dwattr $C$DW$208, DW_AT_decl_line(0x2d0)
    3962                            .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    3963                    
    3964                    $C$DW$209       .dwtag  DW_TAG_member
    3965                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    3966                            .dwattr $C$DW$209, DW_AT_name("ACTLR")
    3967                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ACTLR")
    3968                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3969                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3970                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3971                            .dwattr $C$DW$209, DW_AT_decl_line(0x2d1)
    3972                            .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    3973                    
    3974                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3975                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2ce)
    3976                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3977                            .dwendtag $C$DW$T$50
    3978                    
    3979                    $C$DW$T$333     .dwtag  DW_TAG_typedef
    3980                            .dwattr $C$DW$T$333, DW_AT_name("SCnSCB_Type")
    3981                            .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$50)
    3982                            .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
    3983                            .dwattr $C$DW$T$333, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3984                            .dwattr $C$DW$T$333, DW_AT_decl_line(0x2d2)
    3985                            .dwattr $C$DW$T$333, DW_AT_decl_column(0x03)
    3986                    
    3987                    
    3988                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3989                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    3990                    $C$DW$210       .dwtag  DW_TAG_member
    3991                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$32)
    3992                            .dwattr $C$DW$210, DW_AT_name("CTRL")
    3993                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("CTRL")
    3994                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3995                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3996                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3997                            .dwattr $C$DW$210, DW_AT_decl_line(0x2f7)
    3998                            .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    3999                    
    4000                    $C$DW$211       .dwtag  DW_TAG_member
    4001                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$32)
    4002                            .dwattr $C$DW$211, DW_AT_name("LOAD")
    4003                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("LOAD")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   74

    4004                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4005                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4006                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4007                            .dwattr $C$DW$211, DW_AT_decl_line(0x2f8)
    4008                            .dwattr $C$DW$211, DW_AT_decl_column(0x12)
    4009                    
    4010                    $C$DW$212       .dwtag  DW_TAG_member
    4011                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$32)
    4012                            .dwattr $C$DW$212, DW_AT_name("VAL")
    4013                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("VAL")
    4014                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4015                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4016                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4017                            .dwattr $C$DW$212, DW_AT_decl_line(0x2f9)
    4018                            .dwattr $C$DW$212, DW_AT_decl_column(0x12)
    4019                    
    4020                    $C$DW$213       .dwtag  DW_TAG_member
    4021                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$42)
    4022                            .dwattr $C$DW$213, DW_AT_name("CALIB")
    4023                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("CALIB")
    4024                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4025                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4026                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4027                            .dwattr $C$DW$213, DW_AT_decl_line(0x2fa)
    4028                            .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    4029                    
    4030                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4031                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2f6)
    4032                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    4033                            .dwendtag $C$DW$T$51
    4034                    
    4035                    $C$DW$T$334     .dwtag  DW_TAG_typedef
    4036                            .dwattr $C$DW$T$334, DW_AT_name("SysTick_Type")
    4037                            .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$51)
    4038                            .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
    4039                            .dwattr $C$DW$T$334, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    4040                            .dwattr $C$DW$T$334, DW_AT_decl_line(0x2fb)
    4041                            .dwattr $C$DW$T$334, DW_AT_decl_column(0x03)
    4042                    
    4043                    
    4044                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4045                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x1000)
    4046                    $C$DW$214       .dwtag  DW_TAG_member
    4047                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$53)
    4048                            .dwattr $C$DW$214, DW_AT_name("PORT")
    4049                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("PORT")
    4050                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4051                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4052                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4053                            .dwattr $C$DW$214, DW_AT_decl_line(0x330)
    4054                            .dwattr $C$DW$214, DW_AT_decl_column(0x06)
    4055                    
    4056                    $C$DW$215       .dwtag  DW_TAG_member
    4057                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$54)
    4058                            .dwattr $C$DW$215, DW_AT_name("RESERVED0")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   75

    4059                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("RESERVED0")
    4060                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    4061                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4062                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4063                            .dwattr $C$DW$215, DW_AT_decl_line(0x331)
    4064                            .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    4065                    
    4066                    $C$DW$216       .dwtag  DW_TAG_member
    4067                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$32)
    4068                            .dwattr $C$DW$216, DW_AT_name("TER")
    4069                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("TER")
    4070                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    4071                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4072                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4073                            .dwattr $C$DW$216, DW_AT_decl_line(0x332)
    4074                            .dwattr $C$DW$216, DW_AT_decl_column(0x12)
    4075                    
    4076                    $C$DW$217       .dwtag  DW_TAG_member
    4077                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$55)
    4078                            .dwattr $C$DW$217, DW_AT_name("RESERVED1")
    4079                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("RESERVED1")
    4080                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    4081                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4082                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4083                            .dwattr $C$DW$217, DW_AT_decl_line(0x333)
    4084                            .dwattr $C$DW$217, DW_AT_decl_column(0x12)
    4085                    
    4086                    $C$DW$218       .dwtag  DW_TAG_member
    4087                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$32)
    4088                            .dwattr $C$DW$218, DW_AT_name("TPR")
    4089                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("TPR")
    4090                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    4091                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4092                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4093                            .dwattr $C$DW$218, DW_AT_decl_line(0x334)
    4094                            .dwattr $C$DW$218, DW_AT_decl_column(0x12)
    4095                    
    4096                    $C$DW$219       .dwtag  DW_TAG_member
    4097                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$55)
    4098                            .dwattr $C$DW$219, DW_AT_name("RESERVED2")
    4099                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("RESERVED2")
    4100                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    4101                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4102                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4103                            .dwattr $C$DW$219, DW_AT_decl_line(0x335)
    4104                            .dwattr $C$DW$219, DW_AT_decl_column(0x12)
    4105                    
    4106                    $C$DW$220       .dwtag  DW_TAG_member
    4107                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$32)
    4108                            .dwattr $C$DW$220, DW_AT_name("TCR")
    4109                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("TCR")
    4110                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    4111                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4112                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4113                            .dwattr $C$DW$220, DW_AT_decl_line(0x336)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   76

    4114                            .dwattr $C$DW$220, DW_AT_decl_column(0x12)
    4115                    
    4116                    $C$DW$221       .dwtag  DW_TAG_member
    4117                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$56)
    4118                            .dwattr $C$DW$221, DW_AT_name("RESERVED3")
    4119                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("RESERVED3")
    4120                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    4121                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4122                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4123                            .dwattr $C$DW$221, DW_AT_decl_line(0x337)
    4124                            .dwattr $C$DW$221, DW_AT_decl_column(0x12)
    4125                    
    4126                    $C$DW$222       .dwtag  DW_TAG_member
    4127                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$32)
    4128                            .dwattr $C$DW$222, DW_AT_name("IWR")
    4129                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("IWR")
    4130                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
    4131                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4132                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4133                            .dwattr $C$DW$222, DW_AT_decl_line(0x338)
    4134                            .dwattr $C$DW$222, DW_AT_decl_column(0x12)
    4135                    
    4136                    $C$DW$223       .dwtag  DW_TAG_member
    4137                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$42)
    4138                            .dwattr $C$DW$223, DW_AT_name("IRR")
    4139                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("IRR")
    4140                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
    4141                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4142                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4143                            .dwattr $C$DW$223, DW_AT_decl_line(0x339)
    4144                            .dwattr $C$DW$223, DW_AT_decl_column(0x12)
    4145                    
    4146                    $C$DW$224       .dwtag  DW_TAG_member
    4147                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$32)
    4148                            .dwattr $C$DW$224, DW_AT_name("IMCR")
    4149                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("IMCR")
    4150                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
    4151                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4152                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4153                            .dwattr $C$DW$224, DW_AT_decl_line(0x33a)
    4154                            .dwattr $C$DW$224, DW_AT_decl_column(0x12)
    4155                    
    4156                    $C$DW$225       .dwtag  DW_TAG_member
    4157                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$57)
    4158                            .dwattr $C$DW$225, DW_AT_name("RESERVED4")
    4159                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("RESERVED4")
    4160                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    4161                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4162                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4163                            .dwattr $C$DW$225, DW_AT_decl_line(0x33b)
    4164                            .dwattr $C$DW$225, DW_AT_decl_column(0x12)
    4165                    
    4166                    $C$DW$226       .dwtag  DW_TAG_member
    4167                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$32)
    4168                            .dwattr $C$DW$226, DW_AT_name("LAR")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:17 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{A97BC406-8410-41E4-9193-8BC39F5BF8E9} PAGE   77

    4169                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("LAR")
    4170                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    4171                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4172                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4173                            .dwattr $C$DW$226, DW_AT_decl_line(0x33c)
    4174                            .dwattr $C$DW$226, DW_AT_decl_column(0x12)
    4175                    
    4176                    $C$DW$227       .dwtag  DW_TAG_member
    4177                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$42)
    4178                            .dwattr $C$DW$227, DW_AT_name("LSR")
    4179                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("LSR")
    4180                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    4181                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4182                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    4183                            .dwattr $C$DW$227, DW_AT_decl_line(0x33d)
    4184                            .dwattr $C$DW$227, DW_AT_decl_column(0x12)
    4185                    
    4186                    $C$DW$228       .dwtag  DW_TAG_member
    4187                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$58)
