TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.5.LTS *
       3                    ;* Date/Time created: Mon Nov 29 14:32:53 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pschaumont\workspace_ccs\workspace_ece4703b21\perfo
      13                            .global taps
      14                            .common taps,32,4
      15                    $C$DW$1 .dwtag  DW_TAG_variable

    2388                            .dwattr $C$DW$121, DW_AT_name("ARM_MATH_TEST_FAILURE")
    2389                            .dwattr $C$DW$121, DW_AT_const_value(-6)
    2390                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2391                            .dwattr $C$DW$121, DW_AT_decl_line(0x18b)
    2392                            .dwattr $C$DW$121, DW_AT_decl_column(0x05)
    2393                    
    2394                            .dwattr $C$DW$T$323, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2395                            .dwattr $C$DW$T$323, DW_AT_decl_line(0x184)
    2396                            .dwattr $C$DW$T$323, DW_AT_decl_column(0x03)
    2397                            .dwendtag $C$DW$T$323
    2398                    
    2399                    $C$DW$T$324     .dwtag  DW_TAG_typedef
    2400                            .dwattr $C$DW$T$324, DW_AT_name("arm_status")
    2401                            .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
    2402                            .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
    2403                            .dwattr $C$DW$T$324, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2404                            .dwattr $C$DW$T$324, DW_AT_decl_line(0x18c)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   45

    2405                            .dwattr $C$DW$T$324, DW_AT_decl_column(0x05)
    2406                    
    2407                    
    2408                    $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
    2409                            .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
    2410                    $C$DW$122       .dwtag  DW_TAG_enumerator
    2411                            .dwattr $C$DW$122, DW_AT_name("BUFLEN_8")
    2412                            .dwattr $C$DW$122, DW_AT_const_value(0x00)
    2413                            .dwattr $C$DW$122, DW_AT_decl_file("..\xlaudio.h")
    2414                            .dwattr $C$DW$122, DW_AT_decl_line(0x2d)
    2415                            .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    2416                    
    2417                    $C$DW$123       .dwtag  DW_TAG_enumerator
    2418                            .dwattr $C$DW$123, DW_AT_name("BUFLEN_16")
    2419                            .dwattr $C$DW$123, DW_AT_const_value(0x01)
    2420                            .dwattr $C$DW$123, DW_AT_decl_file("..\xlaudio.h")
    2421                            .dwattr $C$DW$123, DW_AT_decl_line(0x2e)
    2422                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    2423                    
    2424                    $C$DW$124       .dwtag  DW_TAG_enumerator
    2425                            .dwattr $C$DW$124, DW_AT_name("BUFLEN_32")
    2426                            .dwattr $C$DW$124, DW_AT_const_value(0x02)
    2427                            .dwattr $C$DW$124, DW_AT_decl_file("..\xlaudio.h")
    2428                            .dwattr $C$DW$124, DW_AT_decl_line(0x2f)
    2429                            .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    2430                    
    2431                    $C$DW$125       .dwtag  DW_TAG_enumerator
    2432                            .dwattr $C$DW$125, DW_AT_name("BUFLEN_64")
    2433                            .dwattr $C$DW$125, DW_AT_const_value(0x03)
    2434                            .dwattr $C$DW$125, DW_AT_decl_file("..\xlaudio.h")
    2435                            .dwattr $C$DW$125, DW_AT_decl_line(0x30)
    2436                            .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    2437                    
    2438                    $C$DW$126       .dwtag  DW_TAG_enumerator
    2439                            .dwattr $C$DW$126, DW_AT_name("BUFLEN_128")
    2440                            .dwattr $C$DW$126, DW_AT_const_value(0x04)
    2441                            .dwattr $C$DW$126, DW_AT_decl_file("..\xlaudio.h")
    2442                            .dwattr $C$DW$126, DW_AT_decl_line(0x31)
    2443                            .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    2444                    
    2445                            .dwattr $C$DW$T$325, DW_AT_decl_file("..\xlaudio.h")
    2446                            .dwattr $C$DW$T$325, DW_AT_decl_line(0x2c)
    2447                            .dwattr $C$DW$T$325, DW_AT_decl_column(0x0e)
    2448                            .dwendtag $C$DW$T$325
    2449                    
    2450                    $C$DW$T$326     .dwtag  DW_TAG_typedef
    2451                            .dwattr $C$DW$T$326, DW_AT_name("buflen_enum_t")
    2452                            .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
    2453                            .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    2454                            .dwattr $C$DW$T$326, DW_AT_decl_file("..\xlaudio.h")
    2455                            .dwattr $C$DW$T$326, DW_AT_decl_line(0x32)
    2456                            .dwattr $C$DW$T$326, DW_AT_decl_column(0x03)
    2457                    
    2458                    
    2459                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   46

    2460                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2461                    $C$DW$127       .dwtag  DW_TAG_member
    2462                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$10)
    2463                            .dwattr $C$DW$127, DW_AT_name("quot")
    2464                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("quot")
    2465                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2467                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2468                            .dwattr $C$DW$127, DW_AT_decl_line(0x4e)
    2469                            .dwattr $C$DW$127, DW_AT_decl_column(0x16)
    2470                    
    2471                    $C$DW$128       .dwtag  DW_TAG_member
    2472                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$10)
    2473                            .dwattr $C$DW$128, DW_AT_name("rem")
    2474                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("rem")
    2475                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2476                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2477                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2478                            .dwattr $C$DW$128, DW_AT_decl_line(0x4e)
    2479                            .dwattr $C$DW$128, DW_AT_decl_column(0x1c)
    2480                    
    2481                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2482                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x4e)
    2483                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2484                            .dwendtag $C$DW$T$22
    2485                    
    2486                    $C$DW$T$327     .dwtag  DW_TAG_typedef
    2487                            .dwattr $C$DW$T$327, DW_AT_name("div_t")
    2488                            .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$22)
    2489                            .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    2490                            .dwattr $C$DW$T$327, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2491                            .dwattr $C$DW$T$327, DW_AT_decl_line(0x4e)
    2492                            .dwattr $C$DW$T$327, DW_AT_decl_column(0x23)
    2493                    
    2494                    
    2495                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2496                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    2497                    $C$DW$129       .dwtag  DW_TAG_member
    2498                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$10)
    2499                            .dwattr $C$DW$129, DW_AT_name("quot")
    2500                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("quot")
    2501                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2503                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2504                            .dwattr $C$DW$129, DW_AT_decl_line(0x53)
    2505                            .dwattr $C$DW$129, DW_AT_decl_column(0x16)
    2506                    
    2507                    $C$DW$130       .dwtag  DW_TAG_member
    2508                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$10)
    2509                            .dwattr $C$DW$130, DW_AT_name("rem")
    2510                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("rem")
    2511                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2512                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2513                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2514                            .dwattr $C$DW$130, DW_AT_decl_line(0x53)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   47

    2515                            .dwattr $C$DW$130, DW_AT_decl_column(0x1c)
    2516                    
    2517                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2518                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x53)
    2519                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2520                            .dwendtag $C$DW$T$23
    2521                    
    2522                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    2523                            .dwattr $C$DW$T$328, DW_AT_name("ldiv_t")
    2524                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$23)
    2525                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    2526                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2527                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x53)
    2528                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x23)
    2529                    
    2530                    
    2531                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2532                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    2533                    $C$DW$131       .dwtag  DW_TAG_member
    2534                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$14)
    2535                            .dwattr $C$DW$131, DW_AT_name("quot")
    2536                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("quot")
    2537                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2538                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2539                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2540                            .dwattr $C$DW$131, DW_AT_decl_line(0x5b)
    2541                            .dwattr $C$DW$131, DW_AT_decl_column(0x1c)
    2542                    
    2543                    $C$DW$132       .dwtag  DW_TAG_member
    2544                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$14)
    2545                            .dwattr $C$DW$132, DW_AT_name("rem")
    2546                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("rem")
    2547                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2548                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2550                            .dwattr $C$DW$132, DW_AT_decl_line(0x5b)
    2551                            .dwattr $C$DW$132, DW_AT_decl_column(0x22)
    2552                    
    2553                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2554                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x5b)
    2555                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2556                            .dwendtag $C$DW$T$24
    2557                    
    2558                    $C$DW$T$329     .dwtag  DW_TAG_typedef
    2559                            .dwattr $C$DW$T$329, DW_AT_name("lldiv_t")
    2560                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$24)
    2561                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    2562                            .dwattr $C$DW$T$329, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2563                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x5b)
    2564                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x29)
    2565                    
    2566                    
    2567                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2568                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    2569                    $C$DW$133       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   48

    2570                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$14)
    2571                            .dwattr $C$DW$133, DW_AT_name("__max_align1")
    2572                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("__max_align1")
    2573                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2574                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2575                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2576                            .dwattr $C$DW$133, DW_AT_decl_line(0x7b)
    2577                            .dwattr $C$DW$133, DW_AT_decl_column(0x0c)
    2578                    
    2579                    $C$DW$134       .dwtag  DW_TAG_member
    2580                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$18)
    2581                            .dwattr $C$DW$134, DW_AT_name("__max_align2")
    2582                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("__max_align2")
    2583                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2584                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2585                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2586                            .dwattr $C$DW$134, DW_AT_decl_line(0x7c)
    2587                            .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    2588                    
    2589                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2590                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x7a)
    2591                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2592                            .dwendtag $C$DW$T$25
    2593                    
    2594                    $C$DW$T$330     .dwtag  DW_TAG_typedef
    2595                            .dwattr $C$DW$T$330, DW_AT_name("__max_align_t")
    2596                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$25)
    2597                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
    2598                            .dwattr $C$DW$T$330, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2599                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x7d)
    2600                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
    2601                    
    2602                    
    2603                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2604                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2605                    $C$DW$135       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    2607                            .dwattr $C$DW$135, DW_AT_name("_reserved0")
    2608                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("_reserved0")
    2609                            .dwattr $C$DW$135, DW_AT_bit_offset(0x10)
    2610                            .dwattr $C$DW$135, DW_AT_bit_size(0x10)
    2611                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2613                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2614                            .dwattr $C$DW$135, DW_AT_decl_line(0x105)
    2615                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2616                    
    2617                    $C$DW$136       .dwtag  DW_TAG_member
    2618                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    2619                            .dwattr $C$DW$136, DW_AT_name("GE")
    2620                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("GE")
    2621                            .dwattr $C$DW$136, DW_AT_bit_offset(0x0c)
    2622                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    2623                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   49

    2625                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2626                            .dwattr $C$DW$136, DW_AT_decl_line(0x106)
    2627                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2628                    
    2629                    $C$DW$137       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2631                            .dwattr $C$DW$137, DW_AT_name("_reserved1")
    2632                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("_reserved1")
    2633                            .dwattr $C$DW$137, DW_AT_bit_offset(0x05)
    2634                            .dwattr $C$DW$137, DW_AT_bit_size(0x07)
    2635                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2636                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2637                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2638                            .dwattr $C$DW$137, DW_AT_decl_line(0x107)
    2639                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2640                    
    2641                    $C$DW$138       .dwtag  DW_TAG_member
    2642                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2643                            .dwattr $C$DW$138, DW_AT_name("Q")
    2644                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("Q")
    2645                            .dwattr $C$DW$138, DW_AT_bit_offset(0x04)
    2646                            .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2647                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2648                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2649                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2650                            .dwattr $C$DW$138, DW_AT_decl_line(0x108)
    2651                            .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2652                    
    2653                    $C$DW$139       .dwtag  DW_TAG_member
    2654                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2655                            .dwattr $C$DW$139, DW_AT_name("V")
    2656                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("V")
    2657                            .dwattr $C$DW$139, DW_AT_bit_offset(0x03)
    2658                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2659                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2661                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2662                            .dwattr $C$DW$139, DW_AT_decl_line(0x109)
    2663                            .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2664                    
    2665                    $C$DW$140       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2667                            .dwattr $C$DW$140, DW_AT_name("C")
    2668                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("C")
    2669                            .dwattr $C$DW$140, DW_AT_bit_offset(0x02)
    2670                            .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2671                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2672                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2673                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2674                            .dwattr $C$DW$140, DW_AT_decl_line(0x10a)
    2675                            .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2676                    
    2677                    $C$DW$141       .dwtag  DW_TAG_member
    2678                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2679                            .dwattr $C$DW$141, DW_AT_name("Z")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   50

    2680                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("Z")
    2681                            .dwattr $C$DW$141, DW_AT_bit_offset(0x01)
    2682                            .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2683                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2684                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2685                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2686                            .dwattr $C$DW$141, DW_AT_decl_line(0x10b)
    2687                            .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2688                    
    2689                    $C$DW$142       .dwtag  DW_TAG_member
    2690                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2691                            .dwattr $C$DW$142, DW_AT_name("N")
    2692                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("N")
    2693                            .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2694                            .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2695                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2697                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2698                            .dwattr $C$DW$142, DW_AT_decl_line(0x10c)
    2699                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2700                    
    2701                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2702                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x104)
    2703                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    2704                            .dwendtag $C$DW$T$28
    2705                    
    2706                    
    2707                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2708                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2709                    $C$DW$143       .dwtag  DW_TAG_member
    2710                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2711                            .dwattr $C$DW$143, DW_AT_name("ISR")
    2712                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("ISR")
    2713                            .dwattr $C$DW$143, DW_AT_bit_offset(0x17)
    2714                            .dwattr $C$DW$143, DW_AT_bit_size(0x09)
    2715                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2717                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2718                            .dwattr $C$DW$143, DW_AT_decl_line(0x12c)
    2719                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2720                    
    2721                    $C$DW$144       .dwtag  DW_TAG_member
    2722                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2723                            .dwattr $C$DW$144, DW_AT_name("_reserved0")
    2724                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("_reserved0")
    2725                            .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2726                            .dwattr $C$DW$144, DW_AT_bit_size(0x17)
    2727                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2729                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2730                            .dwattr $C$DW$144, DW_AT_decl_line(0x12d)
    2731                            .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2732                    
    2733                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2734                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x12b)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   51

    2735                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    2736                            .dwendtag $C$DW$T$29
    2737                    
    2738                    
    2739                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2740                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2741                    $C$DW$145       .dwtag  DW_TAG_member
    2742                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2743                            .dwattr $C$DW$145, DW_AT_name("ISR")
    2744                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("ISR")
    2745                            .dwattr $C$DW$145, DW_AT_bit_offset(0x17)
    2746                            .dwattr $C$DW$145, DW_AT_bit_size(0x09)
    2747                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2749                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2750                            .dwattr $C$DW$145, DW_AT_decl_line(0x13e)
    2751                            .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2752                    
    2753                    $C$DW$146       .dwtag  DW_TAG_member
    2754                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2755                            .dwattr $C$DW$146, DW_AT_name("_reserved0")
    2756                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("_reserved0")
    2757                            .dwattr $C$DW$146, DW_AT_bit_offset(0x16)
    2758                            .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2759                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2760                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2761                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2762                            .dwattr $C$DW$146, DW_AT_decl_line(0x13f)
    2763                            .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2764                    
    2765                    $C$DW$147       .dwtag  DW_TAG_member
    2766                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2767                            .dwattr $C$DW$147, DW_AT_name("ICI_IT_1")
    2768                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("ICI_IT_1")
    2769                            .dwattr $C$DW$147, DW_AT_bit_offset(0x10)
    2770                            .dwattr $C$DW$147, DW_AT_bit_size(0x06)
    2771                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2773                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2774                            .dwattr $C$DW$147, DW_AT_decl_line(0x140)
    2775                            .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2776                    
    2777                    $C$DW$148       .dwtag  DW_TAG_member
    2778                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2779                            .dwattr $C$DW$148, DW_AT_name("GE")
    2780                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("GE")
    2781                            .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    2782                            .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    2783                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2785                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2786                            .dwattr $C$DW$148, DW_AT_decl_line(0x141)
    2787                            .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2788                    
    2789                    $C$DW$149       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   52

    2790                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2791                            .dwattr $C$DW$149, DW_AT_name("_reserved1")
    2792                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("_reserved1")
    2793                            .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    2794                            .dwattr $C$DW$149, DW_AT_bit_size(0x04)
    2795                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2797                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2798                            .dwattr $C$DW$149, DW_AT_decl_line(0x142)
    2799                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2800                    
    2801                    $C$DW$150       .dwtag  DW_TAG_member
    2802                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    2803                            .dwattr $C$DW$150, DW_AT_name("T")
    2804                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("T")
    2805                            .dwattr $C$DW$150, DW_AT_bit_offset(0x07)
    2806                            .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2807                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2809                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2810                            .dwattr $C$DW$150, DW_AT_decl_line(0x143)
    2811                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2812                    
    2813                    $C$DW$151       .dwtag  DW_TAG_member
    2814                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2815                            .dwattr $C$DW$151, DW_AT_name("ICI_IT_2")
    2816                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("ICI_IT_2")
    2817                            .dwattr $C$DW$151, DW_AT_bit_offset(0x05)
    2818                            .dwattr $C$DW$151, DW_AT_bit_size(0x02)
    2819                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2820                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2821                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2822                            .dwattr $C$DW$151, DW_AT_decl_line(0x144)
    2823                            .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2824                    
    2825                    $C$DW$152       .dwtag  DW_TAG_member
    2826                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2827                            .dwattr $C$DW$152, DW_AT_name("Q")
    2828                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("Q")
    2829                            .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    2830                            .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2831                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2833                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2834                            .dwattr $C$DW$152, DW_AT_decl_line(0x145)
    2835                            .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2836                    
    2837                    $C$DW$153       .dwtag  DW_TAG_member
    2838                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2839                            .dwattr $C$DW$153, DW_AT_name("V")
    2840                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("V")
    2841                            .dwattr $C$DW$153, DW_AT_bit_offset(0x03)
    2842                            .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2843                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   53

    2845                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2846                            .dwattr $C$DW$153, DW_AT_decl_line(0x146)
    2847                            .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2848                    
    2849                    $C$DW$154       .dwtag  DW_TAG_member
    2850                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    2851                            .dwattr $C$DW$154, DW_AT_name("C")
    2852                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("C")
    2853                            .dwattr $C$DW$154, DW_AT_bit_offset(0x02)
    2854                            .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2855                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2857                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2858                            .dwattr $C$DW$154, DW_AT_decl_line(0x147)
    2859                            .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2860                    
    2861                    $C$DW$155       .dwtag  DW_TAG_member
    2862                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2863                            .dwattr $C$DW$155, DW_AT_name("Z")
    2864                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("Z")
    2865                            .dwattr $C$DW$155, DW_AT_bit_offset(0x01)
    2866                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2867                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2868                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2869                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2870                            .dwattr $C$DW$155, DW_AT_decl_line(0x148)
    2871                            .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2872                    
    2873                    $C$DW$156       .dwtag  DW_TAG_member
    2874                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    2875                            .dwattr $C$DW$156, DW_AT_name("N")
    2876                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("N")
    2877                            .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2878                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2879                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2881                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2882                            .dwattr $C$DW$156, DW_AT_decl_line(0x149)
    2883                            .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2884                    
    2885                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2886                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x13d)
    2887                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2888                            .dwendtag $C$DW$T$30
    2889                    
    2890                    
    2891                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2892                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2893                    $C$DW$157       .dwtag  DW_TAG_member
    2894                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    2895                            .dwattr $C$DW$157, DW_AT_name("nPRIV")
    2896                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("nPRIV")
    2897                            .dwattr $C$DW$157, DW_AT_bit_offset(0x1f)
    2898                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2899                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   54

    2900                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2901                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2902                            .dwattr $C$DW$157, DW_AT_decl_line(0x175)
    2903                            .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2904                    
    2905                    $C$DW$158       .dwtag  DW_TAG_member
    2906                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2907                            .dwattr $C$DW$158, DW_AT_name("SPSEL")
    2908                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("SPSEL")
    2909                            .dwattr $C$DW$158, DW_AT_bit_offset(0x1e)
    2910                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2911                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2912                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2913                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2914                            .dwattr $C$DW$158, DW_AT_decl_line(0x176)
    2915                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2916                    
    2917                    $C$DW$159       .dwtag  DW_TAG_member
    2918                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    2919                            .dwattr $C$DW$159, DW_AT_name("FPCA")
    2920                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("FPCA")
    2921                            .dwattr $C$DW$159, DW_AT_bit_offset(0x1d)
    2922                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2923                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2925                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2926                            .dwattr $C$DW$159, DW_AT_decl_line(0x177)
    2927                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2928                    
    2929                    $C$DW$160       .dwtag  DW_TAG_member
    2930                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    2931                            .dwattr $C$DW$160, DW_AT_name("_reserved0")
    2932                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("_reserved0")
    2933                            .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2934                            .dwattr $C$DW$160, DW_AT_bit_size(0x1d)
    2935                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2936                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2937                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2938                            .dwattr $C$DW$160, DW_AT_decl_line(0x178)
    2939                            .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2940                    
    2941                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2942                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x174)
    2943                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2944                            .dwendtag $C$DW$T$31
    2945                    
    2946                    
    2947                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2948                            .dwattr $C$DW$T$41, DW_AT_byte_size(0xe04)
    2949                    $C$DW$161       .dwtag  DW_TAG_member
    2950                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$33)
    2951                            .dwattr $C$DW$161, DW_AT_name("ISER")
    2952                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("ISER")
    2953                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   55

    2955                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2956                            .dwattr $C$DW$161, DW_AT_decl_line(0x196)
    2957                            .dwattr $C$DW$161, DW_AT_decl_column(0x12)
    2958                    
    2959                    $C$DW$162       .dwtag  DW_TAG_member
    2960                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$34)
    2961                            .dwattr $C$DW$162, DW_AT_name("RESERVED0")
    2962                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("RESERVED0")
    2963                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2964                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2966                            .dwattr $C$DW$162, DW_AT_decl_line(0x197)
    2967                            .dwattr $C$DW$162, DW_AT_decl_column(0x12)
    2968                    
    2969                    $C$DW$163       .dwtag  DW_TAG_member
    2970                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$33)
    2971                            .dwattr $C$DW$163, DW_AT_name("ICER")
    2972                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ICER")
    2973                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2974                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2975                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2976                            .dwattr $C$DW$163, DW_AT_decl_line(0x198)
    2977                            .dwattr $C$DW$163, DW_AT_decl_column(0x12)
    2978                    
    2979                    $C$DW$164       .dwtag  DW_TAG_member
    2980                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    2981                            .dwattr $C$DW$164, DW_AT_name("RSERVED1")
    2982                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("RSERVED1")
    2983                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2984                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2985                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2986                            .dwattr $C$DW$164, DW_AT_decl_line(0x199)
    2987                            .dwattr $C$DW$164, DW_AT_decl_column(0x12)
    2988                    
    2989                    $C$DW$165       .dwtag  DW_TAG_member
    2990                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$33)
    2991                            .dwattr $C$DW$165, DW_AT_name("ISPR")
    2992                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("ISPR")
    2993                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2994                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2995                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2996                            .dwattr $C$DW$165, DW_AT_decl_line(0x19a)
    2997                            .dwattr $C$DW$165, DW_AT_decl_column(0x12)
    2998                    
    2999                    $C$DW$166       .dwtag  DW_TAG_member
    3000                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$34)
    3001                            .dwattr $C$DW$166, DW_AT_name("RESERVED2")
    3002                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("RESERVED2")
    3003                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3004                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3005                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3006                            .dwattr $C$DW$166, DW_AT_decl_line(0x19b)
    3007                            .dwattr $C$DW$166, DW_AT_decl_column(0x12)
    3008                    
    3009                    $C$DW$167       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   56

    3010                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$33)
    3011                            .dwattr $C$DW$167, DW_AT_name("ICPR")
    3012                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("ICPR")
    3013                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3014                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3015                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3016                            .dwattr $C$DW$167, DW_AT_decl_line(0x19c)
    3017                            .dwattr $C$DW$167, DW_AT_decl_column(0x12)
    3018                    
    3019                    $C$DW$168       .dwtag  DW_TAG_member
    3020                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$34)
    3021                            .dwattr $C$DW$168, DW_AT_name("RESERVED3")
    3022                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("RESERVED3")
    3023                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3024                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3025                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3026                            .dwattr $C$DW$168, DW_AT_decl_line(0x19d)
    3027                            .dwattr $C$DW$168, DW_AT_decl_column(0x12)
    3028                    
    3029                    $C$DW$169       .dwtag  DW_TAG_member
    3030                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$33)
    3031                            .dwattr $C$DW$169, DW_AT_name("IABR")
    3032                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("IABR")
    3033                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3034                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3035                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3036                            .dwattr $C$DW$169, DW_AT_decl_line(0x19e)
    3037                            .dwattr $C$DW$169, DW_AT_decl_column(0x12)
    3038                    
    3039                    $C$DW$170       .dwtag  DW_TAG_member
    3040                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$35)
    3041                            .dwattr $C$DW$170, DW_AT_name("RESERVED4")
    3042                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("RESERVED4")
    3043                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3044                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3045                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3046                            .dwattr $C$DW$170, DW_AT_decl_line(0x19f)
    3047                            .dwattr $C$DW$170, DW_AT_decl_column(0x12)
    3048                    
    3049                    $C$DW$171       .dwtag  DW_TAG_member
    3050                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$39)
    3051                            .dwattr $C$DW$171, DW_AT_name("IP")
    3052                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("IP")
    3053                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    3054                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3055                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3056                            .dwattr $C$DW$171, DW_AT_decl_line(0x1a0)
    3057                            .dwattr $C$DW$171, DW_AT_decl_column(0x12)
    3058                    
    3059                    $C$DW$172       .dwtag  DW_TAG_member
    3060                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    3061                            .dwattr $C$DW$172, DW_AT_name("RESERVED5")
    3062                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("RESERVED5")
    3063                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    3064                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   57

    3065                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3066                            .dwattr $C$DW$172, DW_AT_decl_line(0x1a1)
    3067                            .dwattr $C$DW$172, DW_AT_decl_column(0x12)
    3068                    
    3069                    $C$DW$173       .dwtag  DW_TAG_member
    3070                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$32)
    3071                            .dwattr $C$DW$173, DW_AT_name("STIR")
    3072                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("STIR")
    3073                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3074                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3075                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3076                            .dwattr $C$DW$173, DW_AT_decl_line(0x1a2)
    3077                            .dwattr $C$DW$173, DW_AT_decl_column(0x12)
    3078                    
    3079                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3080                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x195)
    3081                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    3082                            .dwendtag $C$DW$T$41
    3083                    
    3084                    $C$DW$T$331     .dwtag  DW_TAG_typedef
    3085                            .dwattr $C$DW$T$331, DW_AT_name("NVIC_Type")
    3086                            .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$41)
    3087                            .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
    3088                            .dwattr $C$DW$T$331, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3089                            .dwattr $C$DW$T$331, DW_AT_decl_line(0x1a3)
    3090                            .dwattr $C$DW$T$331, DW_AT_decl_column(0x04)
    3091                    
    3092                    
    3093                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3094                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x8c)
    3095                    $C$DW$174       .dwtag  DW_TAG_member
    3096                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$42)
    3097                            .dwattr $C$DW$174, DW_AT_name("CPUID")
    3098                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("CPUID")
    3099                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3100                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3101                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3102                            .dwattr $C$DW$174, DW_AT_decl_line(0x1b8)
    3103                            .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    3104                    
    3105                    $C$DW$175       .dwtag  DW_TAG_member
    3106                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$32)
    3107                            .dwattr $C$DW$175, DW_AT_name("ICSR")
    3108                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ICSR")
    3109                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3110                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3111                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3112                            .dwattr $C$DW$175, DW_AT_decl_line(0x1b9)
    3113                            .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    3114                    
    3115                    $C$DW$176       .dwtag  DW_TAG_member
    3116                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    3117                            .dwattr $C$DW$176, DW_AT_name("VTOR")
    3118                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("VTOR")
    3119                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   58

    3120                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3121                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3122                            .dwattr $C$DW$176, DW_AT_decl_line(0x1ba)
    3123                            .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    3124                    
    3125                    $C$DW$177       .dwtag  DW_TAG_member
    3126                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    3127                            .dwattr $C$DW$177, DW_AT_name("AIRCR")
    3128                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("AIRCR")
    3129                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3130                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3131                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3132                            .dwattr $C$DW$177, DW_AT_decl_line(0x1bb)
    3133                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    3134                    
    3135                    $C$DW$178       .dwtag  DW_TAG_member
    3136                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
    3137                            .dwattr $C$DW$178, DW_AT_name("SCR")
    3138                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("SCR")
    3139                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3140                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3141                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3142                            .dwattr $C$DW$178, DW_AT_decl_line(0x1bc)
    3143                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    3144                    
    3145                    $C$DW$179       .dwtag  DW_TAG_member
    3146                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$32)
    3147                            .dwattr $C$DW$179, DW_AT_name("CCR")
    3148                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("CCR")
    3149                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3150                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3151                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3152                            .dwattr $C$DW$179, DW_AT_decl_line(0x1bd)
    3153                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    3154                    
    3155                    $C$DW$180       .dwtag  DW_TAG_member
    3156                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$43)
    3157                            .dwattr $C$DW$180, DW_AT_name("SHP")
    3158                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("SHP")
    3159                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3160                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3161                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3162                            .dwattr $C$DW$180, DW_AT_decl_line(0x1be)
    3163                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    3164                    
    3165                    $C$DW$181       .dwtag  DW_TAG_member
    3166                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$32)
    3167                            .dwattr $C$DW$181, DW_AT_name("SHCSR")
    3168                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("SHCSR")
    3169                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3170                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3171                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3172                            .dwattr $C$DW$181, DW_AT_decl_line(0x1bf)
    3173                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    3174                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   59

    3175                    $C$DW$182       .dwtag  DW_TAG_member
    3176                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$32)
    3177                            .dwattr $C$DW$182, DW_AT_name("CFSR")
    3178                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("CFSR")
    3179                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3180                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3181                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3182                            .dwattr $C$DW$182, DW_AT_decl_line(0x1c0)
    3183                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    3184                    
    3185                    $C$DW$183       .dwtag  DW_TAG_member
    3186                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$32)
    3187                            .dwattr $C$DW$183, DW_AT_name("HFSR")
    3188                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("HFSR")
    3189                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3190                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3191                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3192                            .dwattr $C$DW$183, DW_AT_decl_line(0x1c1)
    3193                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    3194                    
    3195                    $C$DW$184       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$32)
    3197                            .dwattr $C$DW$184, DW_AT_name("DFSR")
    3198                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("DFSR")
    3199                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3200                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3201                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3202                            .dwattr $C$DW$184, DW_AT_decl_line(0x1c2)
    3203                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    3204                    
    3205                    $C$DW$185       .dwtag  DW_TAG_member
    3206                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    3207                            .dwattr $C$DW$185, DW_AT_name("MMFAR")
    3208                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("MMFAR")
    3209                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3210                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3211                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3212                            .dwattr $C$DW$185, DW_AT_decl_line(0x1c3)
    3213                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    3214                    
    3215                    $C$DW$186       .dwtag  DW_TAG_member
    3216                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    3217                            .dwattr $C$DW$186, DW_AT_name("BFAR")
    3218                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("BFAR")
    3219                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3220                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3221                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3222                            .dwattr $C$DW$186, DW_AT_decl_line(0x1c4)
    3223                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    3224                    
    3225                    $C$DW$187       .dwtag  DW_TAG_member
    3226                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    3227                            .dwattr $C$DW$187, DW_AT_name("AFSR")
    3228                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("AFSR")
    3229                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   60

    3230                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3231                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3232                            .dwattr $C$DW$187, DW_AT_decl_line(0x1c5)
    3233                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    3234                    
    3235                    $C$DW$188       .dwtag  DW_TAG_member
    3236                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$44)
    3237                            .dwattr $C$DW$188, DW_AT_name("PFR")
    3238                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("PFR")
    3239                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3240                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3241                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3242                            .dwattr $C$DW$188, DW_AT_decl_line(0x1c6)
    3243                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    3244                    
    3245                    $C$DW$189       .dwtag  DW_TAG_member
    3246                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$42)
    3247                            .dwattr $C$DW$189, DW_AT_name("DFR")
    3248                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("DFR")
    3249                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3250                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3251                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3252                            .dwattr $C$DW$189, DW_AT_decl_line(0x1c7)
    3253                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    3254                    
    3255                    $C$DW$190       .dwtag  DW_TAG_member
    3256                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$42)
    3257                            .dwattr $C$DW$190, DW_AT_name("ADR")
    3258                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ADR")
    3259                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3260                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3261                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3262                            .dwattr $C$DW$190, DW_AT_decl_line(0x1c8)
    3263                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    3264                    
    3265                    $C$DW$191       .dwtag  DW_TAG_member
    3266                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$45)
    3267                            .dwattr $C$DW$191, DW_AT_name("MMFR")
    3268                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("MMFR")
    3269                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3270                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3271                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3272                            .dwattr $C$DW$191, DW_AT_decl_line(0x1c9)
    3273                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3274                    
    3275                    $C$DW$192       .dwtag  DW_TAG_member
    3276                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$46)
    3277                            .dwattr $C$DW$192, DW_AT_name("ISAR")
    3278                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("ISAR")
    3279                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3280                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3281                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3282                            .dwattr $C$DW$192, DW_AT_decl_line(0x1ca)
    3283                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3284                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   61

    3285                    $C$DW$193       .dwtag  DW_TAG_member
    3286                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$47)
    3287                            .dwattr $C$DW$193, DW_AT_name("RESERVED0")
    3288                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("RESERVED0")
    3289                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3290                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3291                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3292                            .dwattr $C$DW$193, DW_AT_decl_line(0x1cb)
    3293                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3294                    
    3295                    $C$DW$194       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$32)
    3297                            .dwattr $C$DW$194, DW_AT_name("CPACR")
    3298                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("CPACR")
    3299                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3300                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3301                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3302                            .dwattr $C$DW$194, DW_AT_decl_line(0x1cc)
    3303                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3304                    
    3305                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3306                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x1b7)
    3307                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    3308                            .dwendtag $C$DW$T$48
    3309                    
    3310                    $C$DW$T$332     .dwtag  DW_TAG_typedef
    3311                            .dwattr $C$DW$T$332, DW_AT_name("SCB_Type")
    3312                            .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$48)
    3313                            .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
    3314                            .dwattr $C$DW$T$332, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3315                            .dwattr $C$DW$T$332, DW_AT_decl_line(0x1cd)
    3316                            .dwattr $C$DW$T$332, DW_AT_decl_column(0x03)
    3317                    
    3318                    
    3319                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3320                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    3321                    $C$DW$195       .dwtag  DW_TAG_member
    3322                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$49)
    3323                            .dwattr $C$DW$195, DW_AT_name("RESERVED0")
    3324                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("RESERVED0")
    3325                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3326                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3327                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3328                            .dwattr $C$DW$195, DW_AT_decl_line(0x2cf)
    3329                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3330                    
    3331                    $C$DW$196       .dwtag  DW_TAG_member
    3332                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$42)
    3333                            .dwattr $C$DW$196, DW_AT_name("ICTR")
    3334                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ICTR")
    3335                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3336                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3337                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3338                            .dwattr $C$DW$196, DW_AT_decl_line(0x2d0)
    3339                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   62

    3340                    
    3341                    $C$DW$197       .dwtag  DW_TAG_member
    3342                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    3343                            .dwattr $C$DW$197, DW_AT_name("ACTLR")
    3344                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("ACTLR")
    3345                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3346                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3347                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3348                            .dwattr $C$DW$197, DW_AT_decl_line(0x2d1)
    3349                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3350                    
    3351                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3352                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2ce)
    3353                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3354                            .dwendtag $C$DW$T$50
    3355                    
    3356                    $C$DW$T$333     .dwtag  DW_TAG_typedef
    3357                            .dwattr $C$DW$T$333, DW_AT_name("SCnSCB_Type")
    3358                            .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$50)
    3359                            .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
    3360                            .dwattr $C$DW$T$333, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3361                            .dwattr $C$DW$T$333, DW_AT_decl_line(0x2d2)
    3362                            .dwattr $C$DW$T$333, DW_AT_decl_column(0x03)
    3363                    
    3364                    
    3365                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3366                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    3367                    $C$DW$198       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$32)
    3369                            .dwattr $C$DW$198, DW_AT_name("CTRL")
    3370                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("CTRL")
    3371                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3372                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3374                            .dwattr $C$DW$198, DW_AT_decl_line(0x2f7)
    3375                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3376                    
    3377                    $C$DW$199       .dwtag  DW_TAG_member
    3378                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$32)
    3379                            .dwattr $C$DW$199, DW_AT_name("LOAD")
    3380                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("LOAD")
    3381                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3382                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3383                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3384                            .dwattr $C$DW$199, DW_AT_decl_line(0x2f8)
    3385                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3386                    
    3387                    $C$DW$200       .dwtag  DW_TAG_member
    3388                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$32)
    3389                            .dwattr $C$DW$200, DW_AT_name("VAL")
    3390                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("VAL")
    3391                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3392                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3393                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3394                            .dwattr $C$DW$200, DW_AT_decl_line(0x2f9)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   63

    3395                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3396                    
    3397                    $C$DW$201       .dwtag  DW_TAG_member
    3398                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$42)
    3399                            .dwattr $C$DW$201, DW_AT_name("CALIB")
    3400                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("CALIB")
    3401                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3402                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3403                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3404                            .dwattr $C$DW$201, DW_AT_decl_line(0x2fa)
    3405                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3406                    
    3407                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3408                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2f6)
    3409                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    3410                            .dwendtag $C$DW$T$51
    3411                    
    3412                    $C$DW$T$334     .dwtag  DW_TAG_typedef
    3413                            .dwattr $C$DW$T$334, DW_AT_name("SysTick_Type")
    3414                            .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$51)
    3415                            .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
    3416                            .dwattr $C$DW$T$334, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3417                            .dwattr $C$DW$T$334, DW_AT_decl_line(0x2fb)
    3418                            .dwattr $C$DW$T$334, DW_AT_decl_column(0x03)
    3419                    
    3420                    
    3421                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3422                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x1000)
    3423                    $C$DW$202       .dwtag  DW_TAG_member
    3424                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$53)
    3425                            .dwattr $C$DW$202, DW_AT_name("PORT")
    3426                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("PORT")
    3427                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3428                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3429                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3430                            .dwattr $C$DW$202, DW_AT_decl_line(0x330)
    3431                            .dwattr $C$DW$202, DW_AT_decl_column(0x06)
    3432                    
    3433                    $C$DW$203       .dwtag  DW_TAG_member
    3434                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$54)
    3435                            .dwattr $C$DW$203, DW_AT_name("RESERVED0")
    3436                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("RESERVED0")
    3437                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3438                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3439                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3440                            .dwattr $C$DW$203, DW_AT_decl_line(0x331)
    3441                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3442                    
    3443                    $C$DW$204       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$32)
    3445                            .dwattr $C$DW$204, DW_AT_name("TER")
    3446                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("TER")
    3447                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3448                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   64

    3450                            .dwattr $C$DW$204, DW_AT_decl_line(0x332)
    3451                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3452                    
    3453                    $C$DW$205       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$55)
    3455                            .dwattr $C$DW$205, DW_AT_name("RESERVED1")
    3456                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("RESERVED1")
    3457                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    3458                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3459                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3460                            .dwattr $C$DW$205, DW_AT_decl_line(0x333)
    3461                            .dwattr $C$DW$205, DW_AT_decl_column(0x12)
    3462                    
    3463                    $C$DW$206       .dwtag  DW_TAG_member
    3464                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    3465                            .dwattr $C$DW$206, DW_AT_name("TPR")
    3466                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("TPR")
    3467                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    3468                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3469                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3470                            .dwattr $C$DW$206, DW_AT_decl_line(0x334)
    3471                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3472                    
    3473                    $C$DW$207       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$55)
    3475                            .dwattr $C$DW$207, DW_AT_name("RESERVED2")
    3476                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("RESERVED2")
    3477                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    3478                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3480                            .dwattr $C$DW$207, DW_AT_decl_line(0x335)
    3481                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3482                    
    3483                    $C$DW$208       .dwtag  DW_TAG_member
    3484                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    3485                            .dwattr $C$DW$208, DW_AT_name("TCR")
    3486                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("TCR")
    3487                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    3488                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3489                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3490                            .dwattr $C$DW$208, DW_AT_decl_line(0x336)
    3491                            .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    3492                    
    3493                    $C$DW$209       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$56)
    3495                            .dwattr $C$DW$209, DW_AT_name("RESERVED3")
    3496                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("RESERVED3")
    3497                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    3498                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3500                            .dwattr $C$DW$209, DW_AT_decl_line(0x337)
    3501                            .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    3502                    
    3503                    $C$DW$210       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$32)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   65

    3505                            .dwattr $C$DW$210, DW_AT_name("IWR")
    3506                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("IWR")
    3507                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
    3508                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3509                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3510                            .dwattr $C$DW$210, DW_AT_decl_line(0x338)
    3511                            .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    3512                    
    3513                    $C$DW$211       .dwtag  DW_TAG_member
    3514                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$42)
    3515                            .dwattr $C$DW$211, DW_AT_name("IRR")
    3516                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("IRR")
    3517                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
    3518                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3519                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3520                            .dwattr $C$DW$211, DW_AT_decl_line(0x339)
    3521                            .dwattr $C$DW$211, DW_AT_decl_column(0x12)
    3522                    
    3523                    $C$DW$212       .dwtag  DW_TAG_member
    3524                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$32)
    3525                            .dwattr $C$DW$212, DW_AT_name("IMCR")
    3526                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("IMCR")
    3527                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
    3528                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3529                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3530                            .dwattr $C$DW$212, DW_AT_decl_line(0x33a)
    3531                            .dwattr $C$DW$212, DW_AT_decl_column(0x12)
    3532                    
    3533                    $C$DW$213       .dwtag  DW_TAG_member
    3534                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$57)
    3535                            .dwattr $C$DW$213, DW_AT_name("RESERVED4")
    3536                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("RESERVED4")
    3537                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    3538                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3539                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3540                            .dwattr $C$DW$213, DW_AT_decl_line(0x33b)
    3541                            .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    3542                    
    3543                    $C$DW$214       .dwtag  DW_TAG_member
    3544                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$32)
    3545                            .dwattr $C$DW$214, DW_AT_name("LAR")
    3546                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("LAR")
    3547                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    3548                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3549                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3550                            .dwattr $C$DW$214, DW_AT_decl_line(0x33c)
    3551                            .dwattr $C$DW$214, DW_AT_decl_column(0x12)
    3552                    
    3553                    $C$DW$215       .dwtag  DW_TAG_member
    3554                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$42)
    3555                            .dwattr $C$DW$215, DW_AT_name("LSR")
    3556                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("LSR")
    3557                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    3558                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3559                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:32:54 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{C18F80C5-E442-40A5-8A55-CF53FEEA8D83} PAGE   66

    3560                            .dwattr $C$DW$215, DW_AT_decl_line(0x33d)
    3561                            .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    3562                    
    3563                    $C$DW$216       .dwtag  DW_TAG_member
    3564                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$58)
