TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.5.LTS *
       3                    ;* Date/Time created: Mon Nov 29 14:33:27 2021                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\pschaumont\workspace_ccs\workspace_ece4703b21\perfo
      13                            .global taps
      14                            .common taps,32,4
      15                    $C$DW$1 .dwtag  DW_TAG_variable

    2437                            .dwattr $C$DW$123, DW_AT_decl_column(0x05)
    2438                    
    2439                    $C$DW$124       .dwtag  DW_TAG_enumerator
    2440                            .dwattr $C$DW$124, DW_AT_name("ARM_MATH_TEST_FAILURE")
    2441                            .dwattr $C$DW$124, DW_AT_const_value(-6)
    2442                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_part
    2443                            .dwattr $C$DW$124, DW_AT_decl_line(0x18b)
    2444                            .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    2445                    
    2446                            .dwattr $C$DW$T$323, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2447                            .dwattr $C$DW$T$323, DW_AT_decl_line(0x184)
    2448                            .dwattr $C$DW$T$323, DW_AT_decl_column(0x03)
    2449                            .dwendtag $C$DW$T$323
    2450                    
    2451                    $C$DW$T$324     .dwtag  DW_TAG_typedef
    2452                            .dwattr $C$DW$T$324, DW_AT_name("arm_status")
    2453                            .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$323)
    2454                            .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
    2455                            .dwattr $C$DW$T$324, DW_AT_decl_file("C:/ti/simplelink_msp432p4_sdk_3_40_01_02/source/third_pa
    2456                            .dwattr $C$DW$T$324, DW_AT_decl_line(0x18c)
    2457                            .dwattr $C$DW$T$324, DW_AT_decl_column(0x05)
    2458                    
    2459                    
    2460                    $C$DW$T$325     .dwtag  DW_TAG_enumeration_type
    2461                            .dwattr $C$DW$T$325, DW_AT_byte_size(0x01)
    2462                    $C$DW$125       .dwtag  DW_TAG_enumerator
    2463                            .dwattr $C$DW$125, DW_AT_name("BUFLEN_8")
    2464                            .dwattr $C$DW$125, DW_AT_const_value(0x00)
    2465                            .dwattr $C$DW$125, DW_AT_decl_file("..\xlaudio.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   46

    2466                            .dwattr $C$DW$125, DW_AT_decl_line(0x2d)
    2467                            .dwattr $C$DW$125, DW_AT_decl_column(0x05)
    2468                    
    2469                    $C$DW$126       .dwtag  DW_TAG_enumerator
    2470                            .dwattr $C$DW$126, DW_AT_name("BUFLEN_16")
    2471                            .dwattr $C$DW$126, DW_AT_const_value(0x01)
    2472                            .dwattr $C$DW$126, DW_AT_decl_file("..\xlaudio.h")
    2473                            .dwattr $C$DW$126, DW_AT_decl_line(0x2e)
    2474                            .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    2475                    
    2476                    $C$DW$127       .dwtag  DW_TAG_enumerator
    2477                            .dwattr $C$DW$127, DW_AT_name("BUFLEN_32")
    2478                            .dwattr $C$DW$127, DW_AT_const_value(0x02)
    2479                            .dwattr $C$DW$127, DW_AT_decl_file("..\xlaudio.h")
    2480                            .dwattr $C$DW$127, DW_AT_decl_line(0x2f)
    2481                            .dwattr $C$DW$127, DW_AT_decl_column(0x05)
    2482                    
    2483                    $C$DW$128       .dwtag  DW_TAG_enumerator
    2484                            .dwattr $C$DW$128, DW_AT_name("BUFLEN_64")
    2485                            .dwattr $C$DW$128, DW_AT_const_value(0x03)
    2486                            .dwattr $C$DW$128, DW_AT_decl_file("..\xlaudio.h")
    2487                            .dwattr $C$DW$128, DW_AT_decl_line(0x30)
    2488                            .dwattr $C$DW$128, DW_AT_decl_column(0x05)
    2489                    
    2490                    $C$DW$129       .dwtag  DW_TAG_enumerator
    2491                            .dwattr $C$DW$129, DW_AT_name("BUFLEN_128")
    2492                            .dwattr $C$DW$129, DW_AT_const_value(0x04)
    2493                            .dwattr $C$DW$129, DW_AT_decl_file("..\xlaudio.h")
    2494                            .dwattr $C$DW$129, DW_AT_decl_line(0x31)
    2495                            .dwattr $C$DW$129, DW_AT_decl_column(0x05)
    2496                    
    2497                            .dwattr $C$DW$T$325, DW_AT_decl_file("..\xlaudio.h")
    2498                            .dwattr $C$DW$T$325, DW_AT_decl_line(0x2c)
    2499                            .dwattr $C$DW$T$325, DW_AT_decl_column(0x0e)
    2500                            .dwendtag $C$DW$T$325
    2501                    
    2502                    $C$DW$T$326     .dwtag  DW_TAG_typedef
    2503                            .dwattr $C$DW$T$326, DW_AT_name("buflen_enum_t")
    2504                            .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$325)
    2505                            .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    2506                            .dwattr $C$DW$T$326, DW_AT_decl_file("..\xlaudio.h")
    2507                            .dwattr $C$DW$T$326, DW_AT_decl_line(0x32)
    2508                            .dwattr $C$DW$T$326, DW_AT_decl_column(0x03)
    2509                    
    2510                    
    2511                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2512                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2513                    $C$DW$130       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$10)
    2515                            .dwattr $C$DW$130, DW_AT_name("quot")
    2516                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("quot")
    2517                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2520                            .dwattr $C$DW$130, DW_AT_decl_line(0x4e)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   47

    2521                            .dwattr $C$DW$130, DW_AT_decl_column(0x16)
    2522                    
    2523                    $C$DW$131       .dwtag  DW_TAG_member
    2524                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$10)
    2525                            .dwattr $C$DW$131, DW_AT_name("rem")
    2526                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("rem")
    2527                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2528                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2529                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2530                            .dwattr $C$DW$131, DW_AT_decl_line(0x4e)
    2531                            .dwattr $C$DW$131, DW_AT_decl_column(0x1c)
    2532                    
    2533                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2534                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x4e)
    2535                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2536                            .dwendtag $C$DW$T$22
    2537                    
    2538                    $C$DW$T$327     .dwtag  DW_TAG_typedef
    2539                            .dwattr $C$DW$T$327, DW_AT_name("div_t")
    2540                            .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$22)
    2541                            .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    2542                            .dwattr $C$DW$T$327, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2543                            .dwattr $C$DW$T$327, DW_AT_decl_line(0x4e)
    2544                            .dwattr $C$DW$T$327, DW_AT_decl_column(0x23)
    2545                    
    2546                    
    2547                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2548                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    2549                    $C$DW$132       .dwtag  DW_TAG_member
    2550                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$10)
    2551                            .dwattr $C$DW$132, DW_AT_name("quot")
    2552                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("quot")
    2553                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2555                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2556                            .dwattr $C$DW$132, DW_AT_decl_line(0x53)
    2557                            .dwattr $C$DW$132, DW_AT_decl_column(0x16)
    2558                    
    2559                    $C$DW$133       .dwtag  DW_TAG_member
    2560                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$10)
    2561                            .dwattr $C$DW$133, DW_AT_name("rem")
    2562                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("rem")
    2563                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2564                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2565                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2566                            .dwattr $C$DW$133, DW_AT_decl_line(0x53)
    2567                            .dwattr $C$DW$133, DW_AT_decl_column(0x1c)
    2568                    
    2569                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2570                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x53)
    2571                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2572                            .dwendtag $C$DW$T$23
    2573                    
    2574                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    2575                            .dwattr $C$DW$T$328, DW_AT_name("ldiv_t")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   48

    2576                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$23)
    2577                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    2578                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2579                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x53)
    2580                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x23)
    2581                    
    2582                    
    2583                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2584                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    2585                    $C$DW$134       .dwtag  DW_TAG_member
    2586                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$14)
    2587                            .dwattr $C$DW$134, DW_AT_name("quot")
    2588                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("quot")
    2589                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2592                            .dwattr $C$DW$134, DW_AT_decl_line(0x5b)
    2593                            .dwattr $C$DW$134, DW_AT_decl_column(0x1c)
    2594                    
    2595                    $C$DW$135       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$14)
    2597                            .dwattr $C$DW$135, DW_AT_name("rem")
    2598                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("rem")
    2599                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2600                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2602                            .dwattr $C$DW$135, DW_AT_decl_line(0x5b)
    2603                            .dwattr $C$DW$135, DW_AT_decl_column(0x22)
    2604                    
    2605                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2606                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x5b)
    2607                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2608                            .dwendtag $C$DW$T$24
    2609                    
    2610                    $C$DW$T$329     .dwtag  DW_TAG_typedef
    2611                            .dwattr $C$DW$T$329, DW_AT_name("lldiv_t")
    2612                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$24)
    2613                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    2614                            .dwattr $C$DW$T$329, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2615                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x5b)
    2616                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x29)
    2617                    
    2618                    
    2619                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2620                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    2621                    $C$DW$136       .dwtag  DW_TAG_member
    2622                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$14)
    2623                            .dwattr $C$DW$136, DW_AT_name("__max_align1")
    2624                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("__max_align1")
    2625                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2627                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2628                            .dwattr $C$DW$136, DW_AT_decl_line(0x7b)
    2629                            .dwattr $C$DW$136, DW_AT_decl_column(0x0c)
    2630                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   49

    2631                    $C$DW$137       .dwtag  DW_TAG_member
    2632                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$18)
    2633                            .dwattr $C$DW$137, DW_AT_name("__max_align2")
    2634                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("__max_align2")
    2635                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2636                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2637                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/inc
    2638                            .dwattr $C$DW$137, DW_AT_decl_line(0x7c)
    2639                            .dwattr $C$DW$137, DW_AT_decl_column(0x0e)
    2640                    
    2641                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/in
    2642                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x7a)
    2643                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2644                            .dwendtag $C$DW$T$25
    2645                    
    2646                    $C$DW$T$330     .dwtag  DW_TAG_typedef
    2647                            .dwattr $C$DW$T$330, DW_AT_name("__max_align_t")
    2648                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$25)
    2649                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
    2650                            .dwattr $C$DW$T$330, DW_AT_decl_file("C:/ti/ccs1040/ccs/tools/compiler/ti-cgt-arm_20.2.5.LTS/i
    2651                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x7d)
    2652                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
    2653                    
    2654                    
    2655                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2656                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    2657                    $C$DW$138       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2659                            .dwattr $C$DW$138, DW_AT_name("_reserved0")
    2660                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("_reserved0")
    2661                            .dwattr $C$DW$138, DW_AT_bit_offset(0x10)
    2662                            .dwattr $C$DW$138, DW_AT_bit_size(0x10)
    2663                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2664                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2665                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2666                            .dwattr $C$DW$138, DW_AT_decl_line(0x105)
    2667                            .dwattr $C$DW$138, DW_AT_decl_column(0x0e)
    2668                    
    2669                    $C$DW$139       .dwtag  DW_TAG_member
    2670                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$27)
    2671                            .dwattr $C$DW$139, DW_AT_name("GE")
    2672                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("GE")
    2673                            .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    2674                            .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    2675                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2677                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2678                            .dwattr $C$DW$139, DW_AT_decl_line(0x106)
    2679                            .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    2680                    
    2681                    $C$DW$140       .dwtag  DW_TAG_member
    2682                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2683                            .dwattr $C$DW$140, DW_AT_name("_reserved1")
    2684                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("_reserved1")
    2685                            .dwattr $C$DW$140, DW_AT_bit_offset(0x05)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   50

    2686                            .dwattr $C$DW$140, DW_AT_bit_size(0x07)
    2687                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2689                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2690                            .dwattr $C$DW$140, DW_AT_decl_line(0x107)
    2691                            .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    2692                    
    2693                    $C$DW$141       .dwtag  DW_TAG_member
    2694                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    2695                            .dwattr $C$DW$141, DW_AT_name("Q")
    2696                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("Q")
    2697                            .dwattr $C$DW$141, DW_AT_bit_offset(0x04)
    2698                            .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2699                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2702                            .dwattr $C$DW$141, DW_AT_decl_line(0x108)
    2703                            .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2704                    
    2705                    $C$DW$142       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    2707                            .dwattr $C$DW$142, DW_AT_name("V")
    2708                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("V")
    2709                            .dwattr $C$DW$142, DW_AT_bit_offset(0x03)
    2710                            .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2711                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2712                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2713                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2714                            .dwattr $C$DW$142, DW_AT_decl_line(0x109)
    2715                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2716                    
    2717                    $C$DW$143       .dwtag  DW_TAG_member
    2718                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$27)
    2719                            .dwattr $C$DW$143, DW_AT_name("C")
    2720                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("C")
    2721                            .dwattr $C$DW$143, DW_AT_bit_offset(0x02)
    2722                            .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2723                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2724                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2725                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2726                            .dwattr $C$DW$143, DW_AT_decl_line(0x10a)
    2727                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2728                    
    2729                    $C$DW$144       .dwtag  DW_TAG_member
    2730                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2731                            .dwattr $C$DW$144, DW_AT_name("Z")
    2732                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("Z")
    2733                            .dwattr $C$DW$144, DW_AT_bit_offset(0x01)
    2734                            .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    2735                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2736                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2737                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2738                            .dwattr $C$DW$144, DW_AT_decl_line(0x10b)
    2739                            .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    2740                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   51

    2741                    $C$DW$145       .dwtag  DW_TAG_member
    2742                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2743                            .dwattr $C$DW$145, DW_AT_name("N")
    2744                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("N")
    2745                            .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2746                            .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2747                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2749                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2750                            .dwattr $C$DW$145, DW_AT_decl_line(0x10c)
    2751                            .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    2752                    
    2753                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2754                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x104)
    2755                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    2756                            .dwendtag $C$DW$T$28
    2757                    
    2758                    
    2759                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2760                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2761                    $C$DW$146       .dwtag  DW_TAG_member
    2762                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    2763                            .dwattr $C$DW$146, DW_AT_name("ISR")
    2764                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("ISR")
    2765                            .dwattr $C$DW$146, DW_AT_bit_offset(0x17)
    2766                            .dwattr $C$DW$146, DW_AT_bit_size(0x09)
    2767                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2769                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2770                            .dwattr $C$DW$146, DW_AT_decl_line(0x12c)
    2771                            .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2772                    
    2773                    $C$DW$147       .dwtag  DW_TAG_member
    2774                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2775                            .dwattr $C$DW$147, DW_AT_name("_reserved0")
    2776                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("_reserved0")
    2777                            .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2778                            .dwattr $C$DW$147, DW_AT_bit_size(0x17)
    2779                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2781                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2782                            .dwattr $C$DW$147, DW_AT_decl_line(0x12d)
    2783                            .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2784                    
    2785                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2786                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x12b)
    2787                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    2788                            .dwendtag $C$DW$T$29
    2789                    
    2790                    
    2791                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2792                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    2793                    $C$DW$148       .dwtag  DW_TAG_member
    2794                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2795                            .dwattr $C$DW$148, DW_AT_name("ISR")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   52

    2796                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("ISR")
    2797                            .dwattr $C$DW$148, DW_AT_bit_offset(0x17)
    2798                            .dwattr $C$DW$148, DW_AT_bit_size(0x09)
    2799                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2801                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2802                            .dwattr $C$DW$148, DW_AT_decl_line(0x13e)
    2803                            .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2804                    
    2805                    $C$DW$149       .dwtag  DW_TAG_member
    2806                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$27)
    2807                            .dwattr $C$DW$149, DW_AT_name("_reserved0")
    2808                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("_reserved0")
    2809                            .dwattr $C$DW$149, DW_AT_bit_offset(0x16)
    2810                            .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2811                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2813                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2814                            .dwattr $C$DW$149, DW_AT_decl_line(0x13f)
    2815                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2816                    
    2817                    $C$DW$150       .dwtag  DW_TAG_member
    2818                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    2819                            .dwattr $C$DW$150, DW_AT_name("ICI_IT_1")
    2820                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("ICI_IT_1")
    2821                            .dwattr $C$DW$150, DW_AT_bit_offset(0x10)
    2822                            .dwattr $C$DW$150, DW_AT_bit_size(0x06)
    2823                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2826                            .dwattr $C$DW$150, DW_AT_decl_line(0x140)
    2827                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2828                    
    2829                    $C$DW$151       .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2831                            .dwattr $C$DW$151, DW_AT_name("GE")
    2832                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("GE")
    2833                            .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    2834                            .dwattr $C$DW$151, DW_AT_bit_size(0x04)
    2835                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2838                            .dwattr $C$DW$151, DW_AT_decl_line(0x141)
    2839                            .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2840                    
    2841                    $C$DW$152       .dwtag  DW_TAG_member
    2842                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    2843                            .dwattr $C$DW$152, DW_AT_name("_reserved1")
    2844                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("_reserved1")
    2845                            .dwattr $C$DW$152, DW_AT_bit_offset(0x08)
    2846                            .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    2847                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2849                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2850                            .dwattr $C$DW$152, DW_AT_decl_line(0x142)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   53

    2851                            .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2852                    
    2853                    $C$DW$153       .dwtag  DW_TAG_member
    2854                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2855                            .dwattr $C$DW$153, DW_AT_name("T")
    2856                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("T")
    2857                            .dwattr $C$DW$153, DW_AT_bit_offset(0x07)
    2858                            .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2859                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2861                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2862                            .dwattr $C$DW$153, DW_AT_decl_line(0x143)
    2863                            .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2864                    
    2865                    $C$DW$154       .dwtag  DW_TAG_member
    2866                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    2867                            .dwattr $C$DW$154, DW_AT_name("ICI_IT_2")
    2868                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ICI_IT_2")
    2869                            .dwattr $C$DW$154, DW_AT_bit_offset(0x05)
    2870                            .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    2871                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2872                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2873                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2874                            .dwattr $C$DW$154, DW_AT_decl_line(0x144)
    2875                            .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2876                    
    2877                    $C$DW$155       .dwtag  DW_TAG_member
    2878                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2879                            .dwattr $C$DW$155, DW_AT_name("Q")
    2880                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("Q")
    2881                            .dwattr $C$DW$155, DW_AT_bit_offset(0x04)
    2882                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2883                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2885                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2886                            .dwattr $C$DW$155, DW_AT_decl_line(0x145)
    2887                            .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2888                    
    2889                    $C$DW$156       .dwtag  DW_TAG_member
    2890                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$27)
    2891                            .dwattr $C$DW$156, DW_AT_name("V")
    2892                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("V")
    2893                            .dwattr $C$DW$156, DW_AT_bit_offset(0x03)
    2894                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2895                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2896                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2897                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2898                            .dwattr $C$DW$156, DW_AT_decl_line(0x146)
    2899                            .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2900                    
    2901                    $C$DW$157       .dwtag  DW_TAG_member
    2902                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    2903                            .dwattr $C$DW$157, DW_AT_name("C")
    2904                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("C")
    2905                            .dwattr $C$DW$157, DW_AT_bit_offset(0x02)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   54

    2906                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2907                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2908                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2909                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2910                            .dwattr $C$DW$157, DW_AT_decl_line(0x147)
    2911                            .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2912                    
    2913                    $C$DW$158       .dwtag  DW_TAG_member
    2914                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2915                            .dwattr $C$DW$158, DW_AT_name("Z")
    2916                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("Z")
    2917                            .dwattr $C$DW$158, DW_AT_bit_offset(0x01)
    2918                            .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2919                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2921                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2922                            .dwattr $C$DW$158, DW_AT_decl_line(0x148)
    2923                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2924                    
    2925                    $C$DW$159       .dwtag  DW_TAG_member
    2926                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$27)
    2927                            .dwattr $C$DW$159, DW_AT_name("N")
    2928                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("N")
    2929                            .dwattr $C$DW$159, DW_AT_bit_offset(0x00)
    2930                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2931                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2932                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2933                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2934                            .dwattr $C$DW$159, DW_AT_decl_line(0x149)
    2935                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2936                    
    2937                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2938                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x13d)
    2939                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2940                            .dwendtag $C$DW$T$30
    2941                    
    2942                    
    2943                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2944                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    2945                    $C$DW$160       .dwtag  DW_TAG_member
    2946                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    2947                            .dwattr $C$DW$160, DW_AT_name("nPRIV")
    2948                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("nPRIV")
    2949                            .dwattr $C$DW$160, DW_AT_bit_offset(0x1f)
    2950                            .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2951                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2953                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2954                            .dwattr $C$DW$160, DW_AT_decl_line(0x175)
    2955                            .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2956                    
    2957                    $C$DW$161       .dwtag  DW_TAG_member
    2958                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    2959                            .dwattr $C$DW$161, DW_AT_name("SPSEL")
    2960                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("SPSEL")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   55

    2961                            .dwattr $C$DW$161, DW_AT_bit_offset(0x1e)
    2962                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2963                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2964                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2966                            .dwattr $C$DW$161, DW_AT_decl_line(0x176)
    2967                            .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    2968                    
    2969                    $C$DW$162       .dwtag  DW_TAG_member
    2970                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$27)
    2971                            .dwattr $C$DW$162, DW_AT_name("FPCA")
    2972                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("FPCA")
    2973                            .dwattr $C$DW$162, DW_AT_bit_offset(0x1d)
    2974                            .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2975                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2976                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2977                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2978                            .dwattr $C$DW$162, DW_AT_decl_line(0x177)
    2979                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2980                    
    2981                    $C$DW$163       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    2983                            .dwattr $C$DW$163, DW_AT_name("_reserved0")
    2984                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("_reserved0")
    2985                            .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2986                            .dwattr $C$DW$163, DW_AT_bit_size(0x1d)
    2987                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2988                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2989                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2990                            .dwattr $C$DW$163, DW_AT_decl_line(0x178)
    2991                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2992                    
    2993                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2994                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x174)
    2995                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2996                            .dwendtag $C$DW$T$31
    2997                    
    2998                    
    2999                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3000                            .dwattr $C$DW$T$41, DW_AT_byte_size(0xe04)
    3001                    $C$DW$164       .dwtag  DW_TAG_member
    3002                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$33)
    3003                            .dwattr $C$DW$164, DW_AT_name("ISER")
    3004                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("ISER")
    3005                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3006                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3007                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3008                            .dwattr $C$DW$164, DW_AT_decl_line(0x196)
    3009                            .dwattr $C$DW$164, DW_AT_decl_column(0x12)
    3010                    
    3011                    $C$DW$165       .dwtag  DW_TAG_member
    3012                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$34)
    3013                            .dwattr $C$DW$165, DW_AT_name("RESERVED0")
    3014                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("RESERVED0")
    3015                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   56

    3016                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3017                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3018                            .dwattr $C$DW$165, DW_AT_decl_line(0x197)
    3019                            .dwattr $C$DW$165, DW_AT_decl_column(0x12)
    3020                    
    3021                    $C$DW$166       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$33)
    3023                            .dwattr $C$DW$166, DW_AT_name("ICER")
    3024                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ICER")
    3025                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3026                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3028                            .dwattr $C$DW$166, DW_AT_decl_line(0x198)
    3029                            .dwattr $C$DW$166, DW_AT_decl_column(0x12)
    3030                    
    3031                    $C$DW$167       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$34)
    3033                            .dwattr $C$DW$167, DW_AT_name("RSERVED1")
    3034                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("RSERVED1")
    3035                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3036                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3038                            .dwattr $C$DW$167, DW_AT_decl_line(0x199)
    3039                            .dwattr $C$DW$167, DW_AT_decl_column(0x12)
    3040                    
    3041                    $C$DW$168       .dwtag  DW_TAG_member
    3042                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$33)
    3043                            .dwattr $C$DW$168, DW_AT_name("ISPR")
    3044                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ISPR")
    3045                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3046                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3047                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3048                            .dwattr $C$DW$168, DW_AT_decl_line(0x19a)
    3049                            .dwattr $C$DW$168, DW_AT_decl_column(0x12)
    3050                    
    3051                    $C$DW$169       .dwtag  DW_TAG_member
    3052                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$34)
    3053                            .dwattr $C$DW$169, DW_AT_name("RESERVED2")
    3054                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("RESERVED2")
    3055                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    3056                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3057                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3058                            .dwattr $C$DW$169, DW_AT_decl_line(0x19b)
    3059                            .dwattr $C$DW$169, DW_AT_decl_column(0x12)
    3060                    
    3061                    $C$DW$170       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$33)
    3063                            .dwattr $C$DW$170, DW_AT_name("ICPR")
    3064                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ICPR")
    3065                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    3066                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3068                            .dwattr $C$DW$170, DW_AT_decl_line(0x19c)
    3069                            .dwattr $C$DW$170, DW_AT_decl_column(0x12)
    3070                    
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   57

    3071                    $C$DW$171       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$34)
    3073                            .dwattr $C$DW$171, DW_AT_name("RESERVED3")
    3074                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("RESERVED3")
    3075                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    3076                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3078                            .dwattr $C$DW$171, DW_AT_decl_line(0x19d)
    3079                            .dwattr $C$DW$171, DW_AT_decl_column(0x12)
    3080                    
    3081                    $C$DW$172       .dwtag  DW_TAG_member
    3082                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$33)
    3083                            .dwattr $C$DW$172, DW_AT_name("IABR")
    3084                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("IABR")
    3085                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3086                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3087                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3088                            .dwattr $C$DW$172, DW_AT_decl_line(0x19e)
    3089                            .dwattr $C$DW$172, DW_AT_decl_column(0x12)
    3090                    
    3091                    $C$DW$173       .dwtag  DW_TAG_member
    3092                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$35)
    3093                            .dwattr $C$DW$173, DW_AT_name("RESERVED4")
    3094                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("RESERVED4")
    3095                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    3096                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3097                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3098                            .dwattr $C$DW$173, DW_AT_decl_line(0x19f)
    3099                            .dwattr $C$DW$173, DW_AT_decl_column(0x12)
    3100                    
    3101                    $C$DW$174       .dwtag  DW_TAG_member
    3102                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$39)
    3103                            .dwattr $C$DW$174, DW_AT_name("IP")
    3104                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("IP")
    3105                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    3106                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3107                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3108                            .dwattr $C$DW$174, DW_AT_decl_line(0x1a0)
    3109                            .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    3110                    
    3111                    $C$DW$175       .dwtag  DW_TAG_member
    3112                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    3113                            .dwattr $C$DW$175, DW_AT_name("RESERVED5")
    3114                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("RESERVED5")
    3115                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    3116                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3117                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3118                            .dwattr $C$DW$175, DW_AT_decl_line(0x1a1)
    3119                            .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    3120                    
    3121                    $C$DW$176       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    3123                            .dwattr $C$DW$176, DW_AT_name("STIR")
    3124                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("STIR")
    3125                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   58

    3126                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3128                            .dwattr $C$DW$176, DW_AT_decl_line(0x1a2)
    3129                            .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    3130                    
    3131                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3132                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x195)
    3133                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    3134                            .dwendtag $C$DW$T$41
    3135                    
    3136                    $C$DW$T$331     .dwtag  DW_TAG_typedef
    3137                            .dwattr $C$DW$T$331, DW_AT_name("NVIC_Type")
    3138                            .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$41)
    3139                            .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
    3140                            .dwattr $C$DW$T$331, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3141                            .dwattr $C$DW$T$331, DW_AT_decl_line(0x1a3)
    3142                            .dwattr $C$DW$T$331, DW_AT_decl_column(0x04)
    3143                    
    3144                    
    3145                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3146                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x8c)
    3147                    $C$DW$177       .dwtag  DW_TAG_member
    3148                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$42)
    3149                            .dwattr $C$DW$177, DW_AT_name("CPUID")
    3150                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("CPUID")
    3151                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3152                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3153                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3154                            .dwattr $C$DW$177, DW_AT_decl_line(0x1b8)
    3155                            .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    3156                    
    3157                    $C$DW$178       .dwtag  DW_TAG_member
    3158                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
    3159                            .dwattr $C$DW$178, DW_AT_name("ICSR")
    3160                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ICSR")
    3161                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3162                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3163                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3164                            .dwattr $C$DW$178, DW_AT_decl_line(0x1b9)
    3165                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    3166                    
    3167                    $C$DW$179       .dwtag  DW_TAG_member
    3168                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$32)
    3169                            .dwattr $C$DW$179, DW_AT_name("VTOR")
    3170                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("VTOR")
    3171                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3172                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3173                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3174                            .dwattr $C$DW$179, DW_AT_decl_line(0x1ba)
    3175                            .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    3176                    
    3177                    $C$DW$180       .dwtag  DW_TAG_member
    3178                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$32)
    3179                            .dwattr $C$DW$180, DW_AT_name("AIRCR")
    3180                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("AIRCR")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   59

    3181                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3182                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3183                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3184                            .dwattr $C$DW$180, DW_AT_decl_line(0x1bb)
    3185                            .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    3186                    
    3187                    $C$DW$181       .dwtag  DW_TAG_member
    3188                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$32)
    3189                            .dwattr $C$DW$181, DW_AT_name("SCR")
    3190                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("SCR")
    3191                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3192                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3193                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3194                            .dwattr $C$DW$181, DW_AT_decl_line(0x1bc)
    3195                            .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    3196                    
    3197                    $C$DW$182       .dwtag  DW_TAG_member
    3198                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$32)
    3199                            .dwattr $C$DW$182, DW_AT_name("CCR")
    3200                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("CCR")
    3201                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3202                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3203                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3204                            .dwattr $C$DW$182, DW_AT_decl_line(0x1bd)
    3205                            .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    3206                    
    3207                    $C$DW$183       .dwtag  DW_TAG_member
    3208                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$43)
    3209                            .dwattr $C$DW$183, DW_AT_name("SHP")
    3210                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("SHP")
    3211                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3212                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3213                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3214                            .dwattr $C$DW$183, DW_AT_decl_line(0x1be)
    3215                            .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    3216                    
    3217                    $C$DW$184       .dwtag  DW_TAG_member
    3218                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$32)
    3219                            .dwattr $C$DW$184, DW_AT_name("SHCSR")
    3220                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("SHCSR")
    3221                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3222                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3223                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3224                            .dwattr $C$DW$184, DW_AT_decl_line(0x1bf)
    3225                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    3226                    
    3227                    $C$DW$185       .dwtag  DW_TAG_member
    3228                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    3229                            .dwattr $C$DW$185, DW_AT_name("CFSR")
    3230                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("CFSR")
    3231                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3232                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3233                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3234                            .dwattr $C$DW$185, DW_AT_decl_line(0x1c0)
    3235                            .dwattr $C$DW$185, DW_AT_decl_column(0x12)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   60

    3236                    
    3237                    $C$DW$186       .dwtag  DW_TAG_member
    3238                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    3239                            .dwattr $C$DW$186, DW_AT_name("HFSR")
    3240                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("HFSR")
    3241                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3242                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3243                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3244                            .dwattr $C$DW$186, DW_AT_decl_line(0x1c1)
    3245                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    3246                    
    3247                    $C$DW$187       .dwtag  DW_TAG_member
    3248                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    3249                            .dwattr $C$DW$187, DW_AT_name("DFSR")
    3250                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("DFSR")
    3251                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3252                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3253                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3254                            .dwattr $C$DW$187, DW_AT_decl_line(0x1c2)
    3255                            .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    3256                    
    3257                    $C$DW$188       .dwtag  DW_TAG_member
    3258                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    3259                            .dwattr $C$DW$188, DW_AT_name("MMFAR")
    3260                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("MMFAR")
    3261                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3262                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3264                            .dwattr $C$DW$188, DW_AT_decl_line(0x1c3)
    3265                            .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    3266                    
    3267                    $C$DW$189       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    3269                            .dwattr $C$DW$189, DW_AT_name("BFAR")
    3270                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("BFAR")
    3271                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3272                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3274                            .dwattr $C$DW$189, DW_AT_decl_line(0x1c4)
    3275                            .dwattr $C$DW$189, DW_AT_decl_column(0x12)
    3276                    
    3277                    $C$DW$190       .dwtag  DW_TAG_member
    3278                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
    3279                            .dwattr $C$DW$190, DW_AT_name("AFSR")
    3280                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("AFSR")
    3281                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3282                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3283                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3284                            .dwattr $C$DW$190, DW_AT_decl_line(0x1c5)
    3285                            .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    3286                    
    3287                    $C$DW$191       .dwtag  DW_TAG_member
    3288                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$44)
    3289                            .dwattr $C$DW$191, DW_AT_name("PFR")
    3290                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("PFR")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   61

    3291                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3292                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3293                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3294                            .dwattr $C$DW$191, DW_AT_decl_line(0x1c6)
    3295                            .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    3296                    
    3297                    $C$DW$192       .dwtag  DW_TAG_member
    3298                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$42)
    3299                            .dwattr $C$DW$192, DW_AT_name("DFR")
    3300                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("DFR")
    3301                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3302                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3303                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3304                            .dwattr $C$DW$192, DW_AT_decl_line(0x1c7)
    3305                            .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    3306                    
    3307                    $C$DW$193       .dwtag  DW_TAG_member
    3308                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$42)
    3309                            .dwattr $C$DW$193, DW_AT_name("ADR")
    3310                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("ADR")
    3311                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3312                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3313                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3314                            .dwattr $C$DW$193, DW_AT_decl_line(0x1c8)
    3315                            .dwattr $C$DW$193, DW_AT_decl_column(0x12)
    3316                    
    3317                    $C$DW$194       .dwtag  DW_TAG_member
    3318                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$45)
    3319                            .dwattr $C$DW$194, DW_AT_name("MMFR")
    3320                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("MMFR")
    3321                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3322                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3324                            .dwattr $C$DW$194, DW_AT_decl_line(0x1c9)
    3325                            .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    3326                    
    3327                    $C$DW$195       .dwtag  DW_TAG_member
    3328                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$46)
    3329                            .dwattr $C$DW$195, DW_AT_name("ISAR")
    3330                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ISAR")
    3331                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3332                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3333                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3334                            .dwattr $C$DW$195, DW_AT_decl_line(0x1ca)
    3335                            .dwattr $C$DW$195, DW_AT_decl_column(0x12)
    3336                    
    3337                    $C$DW$196       .dwtag  DW_TAG_member
    3338                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$47)
    3339                            .dwattr $C$DW$196, DW_AT_name("RESERVED0")
    3340                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("RESERVED0")
    3341                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3342                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3343                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3344                            .dwattr $C$DW$196, DW_AT_decl_line(0x1cb)
    3345                            .dwattr $C$DW$196, DW_AT_decl_column(0x12)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   62

    3346                    
    3347                    $C$DW$197       .dwtag  DW_TAG_member
    3348                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    3349                            .dwattr $C$DW$197, DW_AT_name("CPACR")
    3350                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("CPACR")
    3351                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    3352                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3353                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3354                            .dwattr $C$DW$197, DW_AT_decl_line(0x1cc)
    3355                            .dwattr $C$DW$197, DW_AT_decl_column(0x12)
    3356                    
    3357                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3358                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x1b7)
    3359                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    3360                            .dwendtag $C$DW$T$48
    3361                    
    3362                    $C$DW$T$332     .dwtag  DW_TAG_typedef
    3363                            .dwattr $C$DW$T$332, DW_AT_name("SCB_Type")
    3364                            .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$48)
    3365                            .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
    3366                            .dwattr $C$DW$T$332, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3367                            .dwattr $C$DW$T$332, DW_AT_decl_line(0x1cd)
    3368                            .dwattr $C$DW$T$332, DW_AT_decl_column(0x03)
    3369                    
    3370                    
    3371                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3372                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    3373                    $C$DW$198       .dwtag  DW_TAG_member
    3374                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$49)
    3375                            .dwattr $C$DW$198, DW_AT_name("RESERVED0")
    3376                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("RESERVED0")
    3377                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3378                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3380                            .dwattr $C$DW$198, DW_AT_decl_line(0x2cf)
    3381                            .dwattr $C$DW$198, DW_AT_decl_column(0x12)
    3382                    
    3383                    $C$DW$199       .dwtag  DW_TAG_member
    3384                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$42)
    3385                            .dwattr $C$DW$199, DW_AT_name("ICTR")
    3386                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("ICTR")
    3387                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3388                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3389                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3390                            .dwattr $C$DW$199, DW_AT_decl_line(0x2d0)
    3391                            .dwattr $C$DW$199, DW_AT_decl_column(0x12)
    3392                    
    3393                    $C$DW$200       .dwtag  DW_TAG_member
    3394                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$32)
    3395                            .dwattr $C$DW$200, DW_AT_name("ACTLR")
    3396                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ACTLR")
    3397                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3398                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3399                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3400                            .dwattr $C$DW$200, DW_AT_decl_line(0x2d1)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   63

    3401                            .dwattr $C$DW$200, DW_AT_decl_column(0x12)
    3402                    
    3403                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3404                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2ce)
    3405                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3406                            .dwendtag $C$DW$T$50
    3407                    
    3408                    $C$DW$T$333     .dwtag  DW_TAG_typedef
    3409                            .dwattr $C$DW$T$333, DW_AT_name("SCnSCB_Type")
    3410                            .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$50)
    3411                            .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
    3412                            .dwattr $C$DW$T$333, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3413                            .dwattr $C$DW$T$333, DW_AT_decl_line(0x2d2)
    3414                            .dwattr $C$DW$T$333, DW_AT_decl_column(0x03)
    3415                    
    3416                    
    3417                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3418                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    3419                    $C$DW$201       .dwtag  DW_TAG_member
    3420                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$32)
    3421                            .dwattr $C$DW$201, DW_AT_name("CTRL")
    3422                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("CTRL")
    3423                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3425                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3426                            .dwattr $C$DW$201, DW_AT_decl_line(0x2f7)
    3427                            .dwattr $C$DW$201, DW_AT_decl_column(0x12)
    3428                    
    3429                    $C$DW$202       .dwtag  DW_TAG_member
    3430                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$32)
    3431                            .dwattr $C$DW$202, DW_AT_name("LOAD")
    3432                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("LOAD")
    3433                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3434                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3435                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3436                            .dwattr $C$DW$202, DW_AT_decl_line(0x2f8)
    3437                            .dwattr $C$DW$202, DW_AT_decl_column(0x12)
    3438                    
    3439                    $C$DW$203       .dwtag  DW_TAG_member
    3440                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$32)
    3441                            .dwattr $C$DW$203, DW_AT_name("VAL")
    3442                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("VAL")
    3443                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3444                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3445                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3446                            .dwattr $C$DW$203, DW_AT_decl_line(0x2f9)
    3447                            .dwattr $C$DW$203, DW_AT_decl_column(0x12)
    3448                    
    3449                    $C$DW$204       .dwtag  DW_TAG_member
    3450                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$42)
    3451                            .dwattr $C$DW$204, DW_AT_name("CALIB")
    3452                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("CALIB")
    3453                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3454                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   64

    3456                            .dwattr $C$DW$204, DW_AT_decl_line(0x2fa)
    3457                            .dwattr $C$DW$204, DW_AT_decl_column(0x12)
    3458                    
    3459                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3460                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2f6)
    3461                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    3462                            .dwendtag $C$DW$T$51
    3463                    
    3464                    $C$DW$T$334     .dwtag  DW_TAG_typedef
    3465                            .dwattr $C$DW$T$334, DW_AT_name("SysTick_Type")
    3466                            .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$51)
    3467                            .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
    3468                            .dwattr $C$DW$T$334, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    3469                            .dwattr $C$DW$T$334, DW_AT_decl_line(0x2fb)
    3470                            .dwattr $C$DW$T$334, DW_AT_decl_column(0x03)
    3471                    
    3472                    
    3473                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3474                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x1000)
    3475                    $C$DW$205       .dwtag  DW_TAG_member
    3476                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$53)
    3477                            .dwattr $C$DW$205, DW_AT_name("PORT")
    3478                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("PORT")
    3479                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3480                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3481                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3482                            .dwattr $C$DW$205, DW_AT_decl_line(0x330)
    3483                            .dwattr $C$DW$205, DW_AT_decl_column(0x06)
    3484                    
    3485                    $C$DW$206       .dwtag  DW_TAG_member
    3486                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$54)
    3487                            .dwattr $C$DW$206, DW_AT_name("RESERVED0")
    3488                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("RESERVED0")
    3489                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3490                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3491                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3492                            .dwattr $C$DW$206, DW_AT_decl_line(0x331)
    3493                            .dwattr $C$DW$206, DW_AT_decl_column(0x12)
    3494                    
    3495                    $C$DW$207       .dwtag  DW_TAG_member
    3496                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$32)
    3497                            .dwattr $C$DW$207, DW_AT_name("TER")
    3498                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("TER")
    3499                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    3500                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3501                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3502                            .dwattr $C$DW$207, DW_AT_decl_line(0x332)
    3503                            .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    3504                    
    3505                    $C$DW$208       .dwtag  DW_TAG_member
    3506                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$55)
    3507                            .dwattr $C$DW$208, DW_AT_name("RESERVED1")
    3508                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("RESERVED1")
    3509                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xe04]
    3510                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   65

    3511                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3512                            .dwattr $C$DW$208, DW_AT_decl_line(0x333)
    3513                            .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    3514                    
    3515                    $C$DW$209       .dwtag  DW_TAG_member
    3516                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    3517                            .dwattr $C$DW$209, DW_AT_name("TPR")
    3518                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("TPR")
    3519                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xe40]
    3520                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3521                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3522                            .dwattr $C$DW$209, DW_AT_decl_line(0x334)
    3523                            .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    3524                    
    3525                    $C$DW$210       .dwtag  DW_TAG_member
    3526                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$55)
    3527                            .dwattr $C$DW$210, DW_AT_name("RESERVED2")
    3528                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("RESERVED2")
    3529                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xe44]
    3530                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3531                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3532                            .dwattr $C$DW$210, DW_AT_decl_line(0x335)
    3533                            .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    3534                    
    3535                    $C$DW$211       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$32)
    3537                            .dwattr $C$DW$211, DW_AT_name("TCR")
    3538                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("TCR")
    3539                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xe80]
    3540                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3541                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3542                            .dwattr $C$DW$211, DW_AT_decl_line(0x336)
    3543                            .dwattr $C$DW$211, DW_AT_decl_column(0x12)
    3544                    
    3545                    $C$DW$212       .dwtag  DW_TAG_member
    3546                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$56)
    3547                            .dwattr $C$DW$212, DW_AT_name("RESERVED3")
    3548                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("RESERVED3")
    3549                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xe84]
    3550                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3551                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3552                            .dwattr $C$DW$212, DW_AT_decl_line(0x337)
    3553                            .dwattr $C$DW$212, DW_AT_decl_column(0x12)
    3554                    
    3555                    $C$DW$213       .dwtag  DW_TAG_member
    3556                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$32)
    3557                            .dwattr $C$DW$213, DW_AT_name("IWR")
    3558                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("IWR")
    3559                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xef8]
    3560                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3561                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3562                            .dwattr $C$DW$213, DW_AT_decl_line(0x338)
    3563                            .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    3564                    
    3565                    $C$DW$214       .dwtag  DW_TAG_member
TI ARM Assembler PC v20.2.5 Mon Nov 29 14:33:27 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
C:\Users\PSCHAU~1\AppData\Local\Temp\{DCC34CBA-9535-4573-905C-F9C061991809} PAGE   66

    3566                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$42)
    3567                            .dwattr $C$DW$214, DW_AT_name("IRR")
    3568                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("IRR")
    3569                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xefc]
    3570                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3571                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3572                            .dwattr $C$DW$214, DW_AT_decl_line(0x339)
    3573                            .dwattr $C$DW$214, DW_AT_decl_column(0x12)
    3574                    
    3575                    $C$DW$215       .dwtag  DW_TAG_member
    3576                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$32)
    3577                            .dwattr $C$DW$215, DW_AT_name("IMCR")
    3578                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("IMCR")
    3579                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xf00]
    3580                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3581                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3582                            .dwattr $C$DW$215, DW_AT_decl_line(0x33a)
    3583                            .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    3584                    
    3585                    $C$DW$216       .dwtag  DW_TAG_member
    3586                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$57)
    3587                            .dwattr $C$DW$216, DW_AT_name("RESERVED4")
    3588                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("RESERVED4")
    3589                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xf04]
    3590                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3591                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3592                            .dwattr $C$DW$216, DW_AT_decl_line(0x33b)
    3593                            .dwattr $C$DW$216, DW_AT_decl_column(0x12)
    3594                    
    3595                    $C$DW$217       .dwtag  DW_TAG_member
    3596                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$32)
    3597                            .dwattr $C$DW$217, DW_AT_name("LAR")
    3598                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("LAR")
    3599                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb0]
    3600                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3602                            .dwattr $C$DW$217, DW_AT_decl_line(0x33c)
    3603                            .dwattr $C$DW$217, DW_AT_decl_column(0x12)
    3604                    
    3605                    $C$DW$218       .dwtag  DW_TAG_member
    3606                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$42)
    3607                            .dwattr $C$DW$218, DW_AT_name("LSR")
    3608                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("LSR")
    3609                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xfb4]
    3610                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3611                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/ccs1040/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    3612                            .dwattr $C$DW$218, DW_AT_decl_line(0x33d)
    3613                            .dwattr $C$DW$218, DW_AT_decl_column(0x12)
    3614                    
    3615                    $C$DW$219       .dwtag  DW_TAG_member
    3616                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$58)
    3617                            .dwattr $C$DW$219, DW_AT_name("RESERVED5")
